{
    "Rigzone": {
        "feed_title": "Rigzone.com: Latest News Headlines",
        "feed_url": "https://www.rigzone.com/news/rss/rigzone_latest.aspx",
        "entries": [
            {
                "title": "Oil Prices Hit Yearly Low Amid Market Exit",
                "link": "https://www.rigzone.com/news/wire/oil_prices_hit_yearly_low_amid_market_exit-05-feb-2025-179544-article/?rss=true",
                "summary": "Oil hit a yearly low as traders exited the market, with WTI down 2.3% to $71.03. Trump's policies, US-China trade tensions, and rising supplies pressured prices.",
                "full_text": "Oil fell to its lowest closing price of the year as traders continued exiting the market in the weeks following President Donald Trump’s inauguration. West Texas Intermediate slid 2.3% to settle at $71.03 a barrel Wednesday as Trump’s positions on everything from war in the Middle East to tariffs on energy weigh on sentiment. Investors pulling out of crude and fuel markets triggered a $17 billion net outflow in the week ending Jan. 31, JPMorgan Chase & Co. analyst Tracey Allen wrote in a note to clients. “Traders are pulling bets on the direction of crude right now,” said Joe DeLaura, a former trader and global energy strategist with Rabobank. “We see crude continuing lower until the next geopolitical outburst juices prices again.” Wednesday’s drop followed a report that the Trump administration will unveil plans to end Russia’s war against Ukraine by next week, a move that would ease the risk of energy supply disruptions. Also weighing on prices: Beijing on Tuesday issued a swift but ..."
            },
            {
                "title": "OPEC+ Damocles Sword Hanging Over Shale Oil Producers",
                "link": "https://www.rigzone.com/news/opec_damocles_sword_hanging_over_shale_oil_producers-05-feb-2025-179542-article/?rss=true",
                "summary": "'OPEC+ decided ... to stick with its plan - to lift production by 120,000 barrels per day every month for 18 months starting April', SEB Chief Commodities Analyst Bjarne Schieldrop highlighted.",
                "full_text": "In a report sent to Rigzone by the Skandinaviska Enskilda Banken AB (SEB) team on Tuesday morning, Bjarne Schieldrop, chief commodities analyst at the company, said “the Damocles Sword of OPEC+” is “hanging over U.S. shale oil producers”. “OPEC+ decided yesterday [Monday] to stick with its plan - to lift production by 120,000 barrels per day every month for 18 months starting April,” Schieldrop noted in the report. “Again and again, it has pushed the start of the production increase further into the future. It could do it yet again. That will depend on circumstances of one - global oil demand growth and two - non-OPEC+ supply growth,” he added. In the report, Schieldrop said “all oil producers in the world know that OPEC+ has … five to six million barrels per day of reserve capacity at hand” and noted that the group “wants to return two to three million barrels per day of this reserve to the market to get back to a more normal reserve level”. “The now increasingly standing threat of OP..."
            }
        ]
    },
    "U.S. Department of Energy": {
        "feed_title": "Department of Energy",
        "feed_url": "https://www.energy.gov/rss.xml",
        "entries": [
            {
                "title": "Solar Achievements Timeline",
                "link": "https://www.energy.gov/eere/solar/solar-achievements-timeline",
                "summary": "<span class=\"field field--string field--title\">Solar Achievements Timeline</span>\n\n<span class=\"field field--author field--uid\" rel=\"schema:author\"><span lang=\"lang\">jason.kardell@…</span></span>\n\n<span class=\"field field--timestamp field--created\"><time datetime=\"2020-06-10T10:34:23-04:00\" title=\"Wednesday, June 10, 2020 - 10:34\">June 10, 2020</time>\n</span>\n\n\n\n\n\n\n<section class=\"layout blade-section--boxed\">\n\n    <div class=\"grid-container\">\n      <div class=\"blade-color \">\n                                      <div class=\"grid-row\">\n                  <div class=\"grid-col\">\n      \n\n<div class=\"block block-layout-builder block-inline-blockbasic\">\n        \n    \n          \n\n            <div class=\"field field--text_default field--body field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p>In 2011, the U.S. Department of Energy's (DOE) Solar Energy Technologies Office (SETO) was tasked with achieving the goals of the SunShot Initiative: to drive down the cost of solar electricity to be fully cost-competitive with traditional energy sources by the end of the decade.</p><p>SunShot builds on a tradition of steady collaboration between DOE's Energy Efficiency and Renewable Energy program and solar industry pioneers. More than half of all solar cell efficiency records have been directly funded by SETO and 30% of all patents in the solar energy field are linked to patents attributable to the DOE. In fact, without the Energy Department's involvement, the average solar photovoltaic (PV) module production cost per watt would have been $5.27 in 2008 rather than $1.92. DOE research and development efforts have&nbsp;<a href=\"https://www.energy.gov/eere/analysis/articles/retrospective-benefit-cost-evaluation-doe-investments-photovoltaic-energy\">accelerated solar industry progress by an estimated 12 years</a>.</p><p>This timeline features the key innovations that have advanced the solar industry in the United States. Learn more about these key events from 1955 to present.&nbsp;&nbsp;</p></div>\n      \n            </div>\n\n\n\n<div class=\"block block-layout-builder block-inline-blockmedia\">\n            \n            \n                          \n\n            <div class=\"field field--entity_reference_entity_view field--field_media field field--name-field-media field--type-entity-reference field--label-hidden field__item\">\n<div>\n  \n<div class=\"timeline\" id=\"timeline-embed--232273\"></div>\n\n</div>\n</div>\n      \n                    \n      </div>\n\n    </div>\n  \n        </div>\n            </div>\n    </div>\n  </section>",
                "full_text": "An official website of the United States government Here's how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. In 2011, the U.S. Department of Energy's (DOE) Solar Energy Technologies Office (SETO) was tasked with achieving the goals of the SunShot Initiative: to drive down the cost of solar electricity to be fully cost-competitive with traditional energy sources by the end of the decade. SunShot builds on a tradition of steady collaboration between DOE's Energy Efficiency and Renewable Energy program and solar industry pioneers. More than half of all solar cell efficiency records have been directly funded by SETO and 30% of all patents in the solar energy field are linked to patents attributable to the DOE. In fact, without the E..."
            }
        ]
    },
    "Offshore Energy.biz": {
        "feed_title": "Offshore Energy",
        "feed_url": "https://www.offshore-energy.biz/feed/",
        "entries": [
            {
                "title": "Two Namibian prospects on TotalEnergies’ drilling agenda in 2025 as it puts off FID for oil discovery",
                "link": "https://www.offshore-energy.biz/two-namibian-prospects-on-totalenergies-drilling-agenda-in-2025-as-it-puts-off-fid-for-oil-discovery/",
                "summary": "<p>TotalEnergies has decided to bump a final investment decision (FID) to next year for its giant oil discovery in the Orange Basin off the coast of Namibia. However, the firm has lined up drilling activities at two prospects in the African country for 2025. </p>\n<p>The post <a href=\"https://www.offshore-energy.biz/two-namibian-prospects-on-totalenergies-drilling-agenda-in-2025-as-it-puts-off-fid-for-oil-discovery/\">Two Namibian prospects on TotalEnergies’ drilling agenda in 2025 as it puts off FID for oil discovery</a> appeared first on <a href=\"https://www.offshore-energy.biz\">Offshore Energy</a>.</p>",
                "full_text": "France’s energy giant TotalEnergies has decided to bump a final investment decision (FID) to next year for its giant oil discovery in the Orange Basin off the coast of Namibia. However, the firm has lined up drilling activities at two prospects in the African country for 2025. Following TotalEnergies’ Venus-1 and Shell’s Graff-1, La Rona-1, and Jonker-1 discoveries, which were interpreted to prove a working light oil system offshore Namibia, the African country started turning into an exploration hotspot. As a result, many oil and gas players began engaging in more drilling activities. The French player’s ultra-deepwater Venus-1X exploration well was drilled at the beginning of December 2021, using the Maersk Voyager drillship. As a result, a light oil and associated gas field was discovered approximately 290 kilometers off the coast of southern Namibia in a water depth of around 3,000 meters. The firm planned to embark on a multi-well drilling program offshore Namibia before the end o..."
            },
            {
                "title": "WATCH: Transocean rig preps to spin the drill bit on €4B gas project",
                "link": "https://www.offshore-energy.biz/watch-transocean-rig-preps-to-spin-the-drill-bit-on-e4b-gas-project/",
                "summary": "<p>With preparations one of the semi-submersible rigs, owned by Transocean, is undergoing in Constanta drawing to a close, a start-up date for a long-term drilling campaign on a natural gas project in the Black Sea is fast approaching. </p>\n<p>The post <a href=\"https://www.offshore-energy.biz/watch-transocean-rig-preps-to-spin-the-drill-bit-on-e4b-gas-project/\">WATCH: Transocean rig preps to spin the drill bit on €4B gas project</a> appeared first on <a href=\"https://www.offshore-energy.biz\">Offshore Energy</a>.</p>",
                "full_text": "With preparations one of the semi-submersible rigs, owned by Switzerland-based offshore drilling contractor Transocean, is undergoing in Constanta drawing to a close, a start-up date for a long-term drilling campaign on a natural gas project in the Black Sea is fast approaching. Transocean won a minimum 540-day contract for the Transocean Barents rig in December 2023 for a drilling program off the coast of Romania with Southeastern Europe’s integrated energy player, OMV Petrom. The semi-submersible rig arrived in Constanta in November 2024 to get ready for its drilling assignment on the company’s Neptun Deep project, which was slated to begin in April 2025. This gas project is being developed by OMV Petrom and Romgaz, with each company having a 50% participating interest. “The Neptun Deep project is underway! Transocean Barents, the mobile offshore drilling unit docked in Constanța, Romania, is being prepared to sail 160 km offshore and start drilling the production wells,” highlighted..."
            }
        ]
    },
    "Energy Voice": {
        "feed_title": "Energy Voice",
        "feed_url": "https://www.energyvoice.com/feed/",
        "entries": [
            {
                "title": "UK government urged to ‘make a decision’ quickly on zonal pricing",
                "link": "https://www.energyvoice.com/all-news/566606/uk-government-urged-to-make-a-decision-quickly-on-zonal-pricing/",
                "summary": "<p>Delays to a decision on zonal electricity pricing are an \"albatross around the neck\" of UK renewable energy developers, a parliamentary committee has heard.</p>\n<p>The post <a href=\"https://www.energyvoice.com/all-news/566606/uk-government-urged-to-make-a-decision-quickly-on-zonal-pricing/\" rel=\"nofollow\">UK government urged to &#8216;make a decision&#8217; quickly on zonal pricing</a> appeared first on <a href=\"https://www.energyvoice.com\" rel=\"nofollow\">Energy Voice</a>.</p>",
                "full_text": "Delays to a decision on zonal electricity pricing are an “albatross around the neck” of UK renewable energy developers, a parliamentary committee has heard. Energy UK director of policy and advocacy Adam Berman said the review of electricity market arrangements (REMA) process has “gone on endlessly now”. Berman said industry developers want to see a quick decision on locational pricing reforms as well as more information on “crucial elements” of how the scheme may be grandfathered in for existing projects. He told the Energy Security and Net Zero committee hearing that “no one knows which way the government’s going to go” and called for clarity as soon as possible. Launched in 2022 under the previous Conservative government, the REMA process is exploring reform options which could split the UK into regional electricity markets. In December, the Department for Energy Security and Net Zero (DESNZ) said no decision has been taken between zonal pricing or “reformed national pricing”. Howev..."
            },
            {
                "title": "Energy Voices: why carbon capture matters at Morecambe",
                "link": "https://www.energyvoice.com/renewables-energy-transition/ccs/566616/carbon-capture-matters-at-morecambe/",
                "summary": "<p>Spirit Energy has concrete plans for enabling a new zero energy system.</p>\n<p>The post <a href=\"https://www.energyvoice.com/renewables-energy-transition/ccs/566616/carbon-capture-matters-at-morecambe/\" rel=\"nofollow\">Energy Voices: why carbon capture matters at Morecambe</a> appeared first on <a href=\"https://www.energyvoice.com\" rel=\"nofollow\">Energy Voice</a>.</p>",
                "full_text": "Spirit Energy has concrete plans for enabling a new zero energy system. Following the sale of oil-producing fields in the Norwegian North Sea in 2022, the firm, which is majority owned by Centrica (LON: CNA) has become almost entirely focused on gas production. And now it is looking at how to apply its experience in this area to the next stage of the energy transition to store carbon. Susan Mackenzie is leading Spirit’s ambitious plans to repurpose depleted gas fields to create the UK’s largest permanent carbon store, capable of storing one billion tons of CO2. Mackenzie moved to Aberdeen in 1999 to complete her MsC in environmental sciences. Her career started in the oil and gas industry which she admits she felt “conflicted” following her training. “But you can work that conflict out because you need power, then you can try and get new developments to mitigate impact on the environment.” Then the opportunity came with Spirit Energy to lead the Morecambe Net Zero (MNZ) project, which ..."
            }
        ]
    },
    "NASA": {
        "feed_title": "NASA",
        "feed_url": "https://www.nasa.gov/news-release/feed/",
        "entries": [
            {
                "title": "NASA Brings Space to New Jersey Classroom with Astronaut Q&A",
                "link": "https://www.nasa.gov/news-release/nasa-brings-space-to-new-jersey-classroom-with-astronaut-qa/",
                "summary": "Students from the Thomas Edison EnergySmart Charter School in Somerset, New Jersey, will have the chance to connect with NASA astronaut Nick Hague as he answers prerecorded science, technology, engineering, and mathematics (STEM) related questions from aboard the International Space Station. Watch the 20-minute space-to-Earth call at 11:10 a.m. EST on Tuesday, Feb. 11, on [&#8230;]",
                "full_text": "2 min read Students from the Thomas Edison EnergySmart Charter School in Somerset, New Jersey, will have the chance to connect with NASA astronaut Nick Hague as he answers prerecorded science, technology, engineering, and mathematics (STEM) related questions from aboard the International Space Station. Watch the 20-minute space-to-Earth call at 11:10 a.m. EST on Tuesday, Feb. 11, on NASA+ and learn how to watch NASA content on various platforms, including social media. Media interested in covering the event must RSVP by 5 p.m., Thursday, Feb. 6, to Jeanette Allison at: oyildiz@energysmartschool.org or 732-412-7643. For more than 24 years, astronauts have continuously lived and worked aboard the space station, testing technologies, performing science, and developing skills needed to explore farther from Earth. Astronauts aboard the orbiting laboratory communicate with NASA’s Mission Control Center in Houston 24 hours a day through SCaN’s (Space Communications and Navigation) Near Space ..."
            },
            {
                "title": "NASA Invites Media to Learn about Spacecraft Autonomous Tech Firsts",
                "link": "https://www.nasa.gov/general/nasa-invites-media-to-learn-about-spacecraft-autonomous-tech-firsts/",
                "summary": "NASA’s Ames Research Center in Silicon Valley invites media to learn more about Distributed Spacecraft Autonomy (DSA), a technology that allows individual spacecraft to make independent decisions while collaborating with each other to achieve common goals – without human input. The DSA team achieved multiple firsts during tests of such swarm technology as part of [&#8230;]",
                "full_text": "2 min read NASA’s Ames Research Center in Silicon Valley invites media to learn more about Distributed Spacecraft Autonomy (DSA), a technology that allows individual spacecraft to make independent decisions while collaborating with each other to achieve common goals – without human input. The DSA team achieved multiple firsts during tests of such swarm technology as part of the agency’s project. DSA develops software tools critical for future autonomous, distributed, and intelligent spacecraft that will need to interact with each other to achieve complex mission objectives. Testing onboard the agency’s Starling mission resulted in accomplishments including the first fully distributed autonomous operation of multiple spacecraft, the first use of space-to-space communications to autonomously share status information between multiple spacecraft, and more. DSA’s accomplishments mark a significant milestone in advancing autonomous systems that will make new types of science and exploration ..."
            }
        ]
    },
    "The Guardian": {
        "feed_title": "Science | The Guardian",
        "feed_url": "https://www.theguardian.com/science/rss",
        "entries": [
            {
                "title": "AI to revolutionise fundamental physics and ‘could show how universe will end’",
                "link": "https://www.theguardian.com/science/2025/feb/03/ai-to-revolutionise-fundamental-physics-and-could-show-how-universe-will-end",
                "summary": "<p>Exclusive: Cern’s next director general Mark Thomson says AI is paving the way for huge advances in particle physics</p><p>Advanced artificial intelligence is to revolutionise fundamental physics and could open a window on to the fate of the universe, according to Cern’s next director general.</p><p>Prof Mark Thomson, the British physicist who will assume leadership of Cern on 1 January 2026, says machine learning is paving the way for advances in particle physics that promise to be comparable to the AI-powered prediction of protein structures that earned <a href=\"https://www.theguardian.com/science/2024/oct/09/google-deepmind-scientists-win-nobel-chemistry-prize\">Google DeepMind scientists a Nobel prize in October</a>.</p> <a href=\"https://www.theguardian.com/science/2025/feb/03/ai-to-revolutionise-fundamental-physics-and-could-show-how-universe-will-end\">Continue reading...</a>",
                "full_text": "Exclusive: Cern’s next director general Mark Thomson says AI is paving the way for huge advances in particle physics Advanced artificial intelligence is to revolutionise fundamental physics and could open a window on to the fate of the universe, according to Cern’s next director general. Prof Mark Thomson, the British physicist who will assume leadership of Cern on 1 January 2026, says machine learning is paving the way for advances in particle physics that promise to be comparable to the AI-powered prediction of protein structures that earned Google DeepMind scientists a Nobel prize in October. At the Large Hadron Collider (LHC), he said, similar strategies are being used to detect incredibly rare events that hold the key to how particles came to acquire mass in the first moments after the big bang and whether our universe could be teetering on the brink of a catastrophic collapse. “These are not incremental improvements,” Thomson said. “These are very, very, very big improvements peo..."
            }
        ]
    },
    "Phys.org": {
        "feed_title": "Phys.org - latest science and technology news stories",
        "feed_url": "https://phys.org/rss-feed/",
        "entries": [
            {
                "title": "Recognizing Indigenous rights in environmental data",
                "link": "https://phys.org/news/2025-02-indigenous-rights-environmental.html",
                "summary": "Every day across the globe, environmental scientists are collecting approximately 274 terabytes of data, a number that is growing thanks to advancements in science and technology.",
                "full_text": "Click here to sign in with or Forget Password? Learn more share this! 4 Tweet Share Email February 5, 2025 This article has been reviewed according to Science X's editorial process and policies. Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked peer-reviewed publication trusted source proofread by Dartmouth College Every day across the globe, environmental scientists are collecting approximately 274 terabytes of data, a number that is growing thanks to advancements in science and technology. The data, which ranges from soil composition to streamflows, is often collected or sampled from ecosystems that are stewarded by Indigenous peoples. In a new Perspectives piece in Nature Communications, a group of researchers called the Earth Data Relations Working Group provide recommendations for how research practices can improve the governance of Indigenous data. With the United Nations Declaration on the Rights of Indigenous Peoples having..."
            }
        ]
    },
    "WIRED AI": {
        "feed_title": "Feed: Artificial Intelligence Latest",
        "feed_url": "https://www.wired.com/feed/tag/ai/latest/rss",
        "entries": [
            {
                "title": "LinkedIn Is Testing an AI Tool That Could Transform How People Search for Jobs",
                "link": "https://www.wired.com/story/linkedin-job-search-artificial-intelligence/",
                "summary": "The company says artificial intelligence could help surface jobs that remain hidden from typical search queries.",
                "full_text": "LinkedIn is testing a new job-hunting tool that uses a custom large language model to comb through huge quantities of data to help people find prospective roles. The company believes that artificial intelligence will help users unearth new roles they might have missed in the typical search process. “The reality is, you don’t find your dream job by checking a set of keywords,” the company’s CEO, Ryan Roslansky, told WIRED in a statement. The new tool, he says, “can help you find relevant jobs you never even knew to search for.” The move comes as AI continues to change how people use the web. On February 2, OpenAI announced a tool called Deep Research that uses its AI to perform in-depth web research for a user. Google offers a similar tool (with exactly the same name, in fact). Among other things, these tools can be used to automate the process of scouring different websites for job openings. LinkedIn gave WIRED a preview of the tool, which is currently being tested by a small group of ..."
            },
            {
                "title": "Google Lifts a Ban on Using Its AI for Weapons and Surveillance",
                "link": "https://www.wired.com/story/google-responsible-ai-principles/",
                "summary": "Google published principles in 2018 barring its AI technology from being used for sensitive purposes. Weeks into President Donald Trump’s second term, those guidelines are being overhauled.",
                "full_text": "Google announced Tuesday that it is overhauling the principles governing how it uses artificial intelligence and other advanced technology. The company removed language promising not to pursue “technologies that cause or are likely to cause overall harm,” “weapons or other technologies whose principal purpose or implementation is to cause or directly facilitate injury to people,” “technologies that gather or use information for surveillance violating internationally accepted norms,” and “technologies whose purpose contravenes widely accepted principles of international law and human rights.” The changes were disclosed in a note appended to the top of a 2018 blog post unveiling the guidelines. “We’ve made updates to our AI Principles. Visit AI.Google for the latest,” the note reads. In a blog post on Tuesday, a pair of Google executives cited the increasingly widespread use of AI, evolving standards, and geopolitical battles over AI as the “backdrop” to why Google’s principles needed to..."
            },
            {
                "title": "Elon Musk Ally Tells Staff 'AI-First’ Is the Future of Key Government Agency",
                "link": "https://www.wired.com/story/elon-musk-lieutenant-gsa-ai-agency/",
                "summary": "Sources say the former Tesla engineer now in charge of the Technology Transformation Services wants an agency that operates like a “startup software company.”",
                "full_text": "In a Monday morning meeting, Thomas Shedd, the recently appointed Technology Transformation Services director and Elon Musk ally, told General Services Administration workers that the agency’s new administrator is pursuing an “AI-first strategy,” sources tell WIRED. Throughout the meeting, Shedd shared his vision for a GSA that operates like a “startup software company,” automating different internal tasks and centralizing data from across the federal government. The Monday meeting, held in-person and on Google Meet, comes days after WIRED reported that many of Musk’s associates have migrated to jobs at the highest levels of the GSA and the Office of Personnel Management (OPM). Prior to joining TTS, which is housed within the GSA, Shedd was a software engineer at Tesla, one of Musk’s companies. The transition has caused mass confusion amongst GSA staffers who have been thrown into surprise one-on-one meetings, forced to present their code—often to young engineers who did not identify t..."
            },
            {
                "title": "Here’s How DeepSeek Censorship Actually Works—and How to Get Around It",
                "link": "https://www.wired.com/story/deepseek-censorship/",
                "summary": "A WIRED investigation shows that the popular Chinese AI model is censored on both the application and training level.",
                "full_text": "Less than two weeks after DeepSeek launched its open-source AI model, the Chinese startup is still dominating the public conversation about the future of artificial intelligence. While the firm seems to have an edge on US rivals in terms of math and reasoning, it also aggressively censors its own replies. Ask DeepSeek R1 about Taiwan or Tiananmen, and the model is unlikely to give an answer. To figure out how this censorship works on a technical level, WIRED tested DeepSeek-R1 on its own app, a version of the app hosted on a third-party platform called Together AI, and another version hosted on a WIRED computer, using the application Ollama. WIRED found that while the most straightforward censorship can be easily avoided by not using DeepSeek’s app, there are other types of bias baked into the model during the training process. Those biases can be removed too, but the procedure is much more complicated. These findings have major implications for DeepSeek and Chinese AI companies genera..."
            }
        ]
    },
    "TIME": {
        "feed_title": "Tech – TIME",
        "feed_url": "http://time.com/tech/feed/",
        "entries": [
            {
                "title": "Is the DeepSeek Panic Overblown?",
                "link": "https://time.com/7211646/is-deepseek-panic-overblown/",
                "summary": "AI scientists contend that the outsize reaction to the rise of the Chinese AI company DeepSeek is misguided.",
                "full_text": "This week, leaders across Silicon Valley, Washington D.C., Wall Street, and beyond have been thrown into disarray due to the unexpected rise of the Chinese AI company DeepSeek. DeepSeek recently released AI models that rivaled OpenAI’s, seemingly for a fraction of the price, and despite American policy designed to slow China’s progress. As a result, many analysts concluded that DeepSeek’s success undermined the core beliefs driving the American AI industry—and that the companies leading this charge, like Nvidia and Microsoft, were not as valuable or technologically ahead as previously believed. Tech stocks dropped hundreds of billions of dollars in days. But AI scientists have pushed back, arguing that many of those fears are exaggerated. They say that while DeepSeek does represent a genuine advancement in AI efficiency, it is not a massive technological breakthrough—and that the American AI industry still has key advantages over China’s. “It’s not a leap forward on AI frontier capabil..."
            },
            {
                "title": "Why AI Safety Researchers Are Worried About DeepSeek",
                "link": "https://time.com/7210888/deepseeks-hidden-ai-safety-warning/",
                "summary": "DeepSeek could open the door to AI reasoning methods that are incomprehensible to humans, raising safety concerns",
                "full_text": "The release of DeepSeek R1 stunned Wall Street and Silicon Valley this month, spooking investors and impressing tech leaders. But amid all the talk, many overlooked a critical detail about the way the new Chinese AI model functions—a nuance that has researchers worried about humanity’s ability to control sophisticated new artificial intelligence systems. It’s all down to an innovation in how DeepSeek R1 was trained—one that led to surprising behaviors in an early version of the model, which researchers described in the technical documentation accompanying its release. During testing, researchers noticed that the model would spontaneously switch between English and Chinese while it was solving problems. When they forced it to stick to one language, thus making it easier for users to follow along, they found that the system’s ability to solve the same problems would diminish. That finding rang alarm bells for some AI safety researchers. Currently, the most capable AI systems “think” in h..."
            }
        ]
    },
    "Tech Insider": {
        "feed_title": "All Content from Business Insider",
        "feed_url": "http://www.techinsider.io/rss",
        "entries": [
            {
                "title": "DeepSeek, DeepSeek, DeepSeek: CEOs keep getting asked about the Chinese AI startup on earnings calls",
                "link": "https://www.businessinsider.com/deepseek-hot-topic-earnings-calls-exec-analyst-questions-2025-1",
                "summary": "If there was a bingo card for earnings calls this quarter, DeepSeek would deserve its own square. Here's what CEOs said about the Chinese AI company.",
                "full_text": "If there was a bingo card for company earnings calls this quarter, DeepSeek would deserve its own square. Stock market surprises have a way of echoing through subsequent earnings calls, and the impact of DeepSeek is reverberating on Wall Street. On recent analyst calls, executives have increasingly fielded questions about the Chinese AI upstart and what its more cost-effective model means for their businesses. The name DeepSeek was mentioned in at least nine earnings calls last week, according to an AlphaSense search, with only a single mention prior to the company's bombshell announcement about its AI models. That number has grown as major tech companies including Alphabet, AMD, Palantir, and Amazon report their earnings. But in spite of the market disruption that saw wild swings in Big Tech share prices, the early outlook is generally optimistic about the tech. Here's what business leaders are telling analysts: DeepSeek is \"great for the industry,\" said Rene Haas, the CEO of ARM, on ..."
            }
        ]
    },
    "Fox News: Tech": {
        "feed_title": "Technology News Articles on Fox News",
        "feed_url": "https://moxie.foxnews.com/google-publisher/tech.xml",
        "entries": [
            {
                "title": "Fox News AI Newsletter: AI takes big step forward with 3D-printed shoe",
                "link": "https://www.foxnews.com/tech/fox-news-ai-newsletter-ai-takes-big-step-forward-3d-printed-shoe",
                "summary": "Stay up to date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.",
                "full_text": "This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper. IN TODAY’S NEWSLETTER: - World's first AI-designed, 3D-printed shoe wants to be the next Crocs - Trump's AI czar flags report questioning DeepSeek's cost of developing AI models - Wheeled wonder robot dog shows off crazy dance moves in all kinds of tough terrain AI-designed, 3D-printed shoe (Syntilay) INNOVATIVE STEP FORWARD: Syntilay, a startup with a sparkle in its eye and artificial intelligence on its mind, has just unveiled what it claims to be the world's first entirely AI-designed and 3D-printed shoe. SETTING THE RECORD STRAIGHT: President Donald Trump's artificial intelligence czar, David Sacks, is pointing to evidence that China's De..."
            }
        ]
    },
    "Oil and Gas IQ": {
        "feed_title": "Articles RSS Feed",
        "feed_url": "https://www.oilandgasiq.com/rss/articles",
        "entries": [
            {
                "title": "Emissions Management in the Upstream Oil and Gas Industry",
                "link": "https://www.oilandgasiq.com/decarbonization/articles/emissions-management-in-the-upstream-oil-and-gas-industry?utm_medium=RSS",
                "summary": "The upstream oil and gas sector has a unique opportunity to lead the charge in sustainability. Here's how...",
                "full_text": "The World’s Largest Community Of Oil and Gas Professionals The upstream oil and gas sector is crucial in global energy supply but at the same time, it is a significant contributor of greenhouse gas emissions, particularly methane. These pollutants make the industry a crucial focus in the fight against climate change, driving the business case for emissions management across the sector. The process of emissions management combines innovative technologies and improved processes to help the energy sector reduce its carbon footprint while staying competitive in the economy. The Challenge of Emissions in Upstream Oil and GasIn 2023, oil and gas operations were responsible for nearly 15% of energy-related greenhouse gas emissions due to three primary culprits - venting, flaring, and fugitive emissions. These byproducts have put the industry under intense environmental and regulatory pressure as governments tighten standards and introduce penalties to curb pollution. Public and investor scrut..."
            },
            {
                "title": "Top 5 Safety Hazards in Oil and Gas",
                "link": "https://www.oilandgasiq.com/connected-worker/articles/top-5-safety-hazards-in-oil-and-gas?utm_medium=RSS",
                "summary": "How to navigate the innate dangers in the oil and gas sector.",
                "full_text": "The World’s Largest Community Of Oil and Gas Professionals Worker safety has come a long way in the past few decades with less than half the number of incidents and worker deaths per 100 workers in 2024 than there were in the 1970s. But there are innate dangers in the oil and gas sector where workers may be exposed to hazardous environments, exposure to hydrocarbon gases and vapors, heavy machinery and equipment and innately dangerous working spaces (such as high up on an oil platform). In 2020, the U.S. Bureau of Labor Statistics recorded 44 employee deaths in the oil and gas extraction industry. The Occupational Safety and Health Administration (OSHA) in the United States recommends that all oil and gas companies have strict policies and procedures in place to help mitigate the risk from these hazards and ensure that all workers and contractors have the appropriate levels of training and PPE to prevent injury. READ: How Chevron and Chevron Phillips Chemical are Prioritizing Worker Sa..."
            },
            {
                "title": "An Introduction to the Oil and Gas Industry",
                "link": "https://www.oilandgasiq.com/operational-excellence/articles/oil-gas-industry-an-introduction?utm_medium=RSS",
                "summary": "Understanding the key sectors in oil and gas: upstream, midstream, and downstream.",
                "full_text": "The World’s Largest Community Of Oil and Gas Professionals Uncovering the oil and gas industry Considered the biggest sector in the world in terms of dollar value, the oil and gas sector is a global powerhouse using hundreds of thousands of workers worldwide and generating hundreds of billions of dollars globally each year. In regions which house the major NOCs, these oil and gas companies are so vital they often contribute a significant amount towards national GDP. In this introduction to the oil and gas industry, we provide a snapshot of the petroleum sector. What are the different oil and gas sectors? The energy sector has three key areas: Upstream, midstream, and downstream. What is upstream? - Upstream is E&P (exploration and exploration). This involves the search for underwater and underground natural gas fields or crude oil fields and the drilling of exploration wells and drilling into established wells to recover oil and gas. What is midstream? - Midstream entails the transport..."
            }
        ]
    },
    "World Oil: Latest News": {
        "feed_title": "World Oil",
        "feed_url": "https://worldoil.com/rss?feed=news",
        "entries": [
            {
                "title": "McDermott completes offshore Malaysia project ahead of schedule",
                "link": "https://www.worldoil.com/news/2025/2/5/mcdermott-completes-offshore-malaysia-project-ahead-of-schedule/",
                "summary": "McDermott has completed transportation, installation, and commissioning activities for the Kikeh subsea gas lift project in under eight months. The Kikeh field first came on stream in 2009 as one of Malaysia's largest deepwater developments.",
                "full_text": "McDermott has announced the safe and successful completion of transportation, installation, and commissioning activities for the Kikeh subsea gas lift project, awarded by PTTEP Sabah Oil Limited (PTTEP) in the first quarter of 2024. The project, executed by the company's Kuala Lumpur (KL) based team, in water depths of approximately 1,400 meters, progressed on a fast-track schedule. It involved the replacement of an existing gas lift riser, and the installation of a new dynamic riser section, flowline, and two thermoplastic composite pipe jumpers. Rigorous safety protocols, readiness planning, robust engineering, and procurement efforts ensured seamless vessel mobilization, and completion of the offshore scope of work in under eight months. \"Completing the project ahead of schedule stands as testament to McDermott's capabilities in delivering safe and efficient solutions for deepwater field development projects,\" said Mahesh Swaminathan, McDermott's Senior Vice President, Subsea and Fl..."
            },
            {
                "title": "New API report highlights broader global adoption of standards",
                "link": "https://www.worldoil.com/news/2025/2/5/new-api-report-highlights-broader-global-adoption-of-standards/",
                "summary": "The American Petroleum Institute (API) has released its ‘2025 API Standards International Usage Report’, detailing the growing international influence of API standards, and highlighting its paramount role in advancing safety, sustainability, and efficiency across the global oil and gas industry.",
                "full_text": "The American Petroleum Institute (API) has released its ‘2025 API Standards International Usage Report’, detailing the growing international influence of API standards. The report identifies where governments and standards bodies reference API standards in policies, national and international standards, and technical regulations, highlighting the paramount role of API standards in advancing safety, sustainability, and efficiency across the global natural gas and oil industry. “As the energy industry continues to evolve, API standards are more important than ever in driving consistent, high-quality practices worldwide,” said API Senior Vice President of Global Industry Services Anchal Liddar. “This report highlights the central role that API standards play in meeting global energy demands safely and sustainably.” The 2025 report examines API standards' usage in 40 international markets across all industry segments and also identifies where API standards are referenced in standards publi..."
            },
            {
                "title": "Saab UK opens new facility to develop advanced radar systems, subsea ROVs",
                "link": "https://www.worldoil.com/news/2025/2/5/saab-uk-opens-new-facility-to-develop-advanced-radar-systems-subsea-rovs/",
                "summary": "Saab UK has announced the official opening of a new manufacturing facility. Opened by the Rt Hon Jonathan Reynolds MP, Secretary of State for Business and Trade, the facility will develop, manufacture, and support Saab's radar systems and Seaeye underwater robotics portfolio.",
                "full_text": "Saab UK has announced the official opening of its new state-of-the-art manufacturing facility in Fareham, Hampshire, marking a milestone in the company’s continued growth. The campus was opened by the Rt Hon Jonathan Reynolds MP, Secretary of State for Business and Trade. The new facility is developing, manufacturing, and supporting Saab's radar systems and market-leading Seaeye underwater robotics portfolio. This includes the 3D multi-mission radar, Giraffe 1X, and the all-electric subsea remotely operated vehicle, Seaeye SR20. The opening marks the conclusion of the investment pledged by Saab in 2023. The site supports up to 400 jobs and provides local opportunities for apprenticeships. It enhances the UK's sovereign radar and underwater robotics manufacturing capabilities, serving both domestic customers and international export markets, with capacity for further growth. Saab’s new campus is expected to significantly benefit the UK Ministry of Defence. The site is a center of excell..."
            }
        ]
    },
    "World Oil: Current Issues": {
        "feed_title": "World Oil",
        "feed_url": "https://worldoil.com/rss?feed=issue",
        "entries": [
            {
                "title": "Optimizing hydraulic fracturing in the Paradox formation: A geomechanical study of the Cane Creek play",
                "link": "https://www.worldoil.com/magazine/2025/january-2025/special-focus-hydraulic-fracturing/optimizing-hydraulic-fracturing-in-the-paradox-formation-a-geomechanical-study-of-the-cane-creek-play/",
                "summary": "The Cane Creek play has unconventional tight oil potential but presents drilling challenges. This article revisits its viability in modern horizontal drilling techniques and proposes a redefined approach to hydraulic fracturing that prioritizes detailed characterization of stress states and fracture dynamics.",
                "full_text": "Z. DVORY and B. J. MCPHERSON, Civil & Environmental Engineering & Energy and Geoscience Institute, and J. D. MCLENNAN, Chemical Engineering & Energy and Geoscience Institute, University of Utah Introduction The Cane Creek play in the Pennsylvanian-age Paradox formation in southeastern Utah is regarded as a promising-yet-challenging, unconventional tight oil play in the U.S., with a history marked by drilling and completion difficulties. Initially identified nearly a century ago, substantial exploration resumed only in the early 1990s with the advent of horizontal drilling technology. Despite some successful wells, achieving substantial production remained elusive. Research, sponsored by the U.S. Department of Energy, aims to leverage the basin's geomechanics knowledge and develop sustainable and economic stimulation strategies. A common hypothesis that local operators hold is that the main challenge in developing the Cane Creek play is successfully accessing natural fractures. Yet, stu..."
            },
            {
                "title": "Digital transformation: Next-generation flexible control system modernizes wellsite operations",
                "link": "https://www.worldoil.com/magazine/2025/january-2025/features/digital-transformation-next-generation-flexible-control-system-modernizes-wellsite-operations/",
                "summary": "The oil and gas industry stands at a critical technological inflection point, where innovation, efficiency and adaptability are no longer optional but essential for survival. One such technology is an advanced platform that can provide a unified, accessible data environment for enhancing collaboration and efficiency.",
                "full_text": "TRAVIS BOLT, NOV The energy sector is undergoing a transformative revolution, driven by relentless pressures to optimize performance, reduce costs and minimize environmental impact. In the past five years, intervention and stimulation technologies have experienced more radical innovation than in the previous decades combined. For instance, hydraulic fracturing techniques have dramatically improved, with frac fleets nearly doubling their linear foot completion rates from an average of 63,470 ft to 125,217 ft per quarter. Advanced technologies are redefining wellsite operations, from sophisticated coiled tubing techniques navigating complex well profiles, to new wireline technologies—such as NOV’s DXtra™ intelligent wireline—which allow for real-time operational feedback. These technological leaps represent more than incremental improvements; they signify a fundamental reimagining of energy extraction processes, promising greater efficiency, reduced environmental footprint and enhanced o..."
            }
        ]
    },
    "OGJ: General Interest": {
        "feed_title": "General Interest | Oil & Gas Journal",
        "feed_url": "https://www.ogj.com/__rss/website-scheduled-content.xml?input=%7B%22sectionAlias%22%3A%22general-interest%22%7D",
        "entries": [
            {
                "title": "ANP to unify two presalt fields offshore Brazil",
                "link": "https://www.ogj.com/general-interest/government/article/55264068/anp-to-unify-brazilian-fields",
                "summary": "The National Agency of Petroleum, Natural Gas and Biofuels (ANP) will unify Berbigão and Sururu fields in concession BM-S-11A in the Santos basin presalt.",
                "full_text": "The National Agency of Petroleum, Natural Gas and Biofuels (ANP) will unify Berbigão and Sururu fields in concession BM-S-11A in the Santos basin presalt. Petróleo Brasileiro SA (Petrobras) is operator with a 42.5% interest. Production of Berbigão and Sururu fields will be reported as a single field, increasing the rate applied to the corresponding Special Participation payment for the unified field, retroactively to the production start date. ANP’s decision to unify these fields also determines the unification of the areas covered by the transfer of rights contract for Entorno de Iara block (South of Berbigão and South of Sururu; North of Berbigão and North of Sururu), all operated by Petrobras (100%). The Superintendence of Government Participations was ordered to calculate the value of Government Participations considering the unified fields. Petrobras is evaluating, within the scope of the consortium, the adoption of appropriate measures in the competent levels and will assess the ..."
            },
            {
                "title": "Chevron plans data center power solutions utilizing US natural gas",
                "link": "https://www.ogj.com/general-interest/article/55264019/chevron-plans-data-center-power-solutions-utilizing-us-natural-gas",
                "summary": "Chevron and Engine No. 1 will form a JV to develop scalable power solutions for US-based data centers running on natural gas.",
                "full_text": "Chevron USA Inc. and investment firm Engine No. 1 will form a joint venture to develop scalable power solutions for US-based data centers running on natural gas. “The partnership will work directly with customers to develop power generation that is dedicated to and co-located with data centers. The power generators will leverage Chevron’s natural gas capabilities and utilize turbines manufactured by GE Vernova,” Chevron chief executive officer and chairman Mike Wirth said in a post to his LinkedIn account Jan. 28. Wirth cited artificial intelligence as “one of the most important technological breakthroughs in recent history, igniting productivity gains across our global economy,” but pointed to the “massive amounts of 24/7 power” needed to scale. A December 2024 report produced by Lawrence Berkeley National Laboratory and presented by the US Department of Energy estimates that data center load growth has tripled over the past decade and is projected to double or triple by 2028. The rep..."
            }
        ]
    },
    "OGJ Exploration and Development": {
        "feed_title": "Exploration & Development | Oil & Gas Journal",
        "feed_url": "https://www.ogj.com/__rss/website-scheduled-content.xml?input=%7B%22sectionAlias%22%3A%22exploration-development%22%7D",
        "entries": [
            {
                "title": "Ecopetrol, Occidental Petroleum extend Rodeo Midland Basin JV development plan",
                "link": "https://www.ogj.com/exploration-development/article/55265644/ecopetrol-occidental-petroleum-extend-rodeo-midland-basin-jv-development-plan",
                "summary": "Ecopetrol and Oxy agreed to extend the development plan of Rodeo Midland Basin LLC under a JV signed in 2019.",
                "full_text": "Ecopetrol SA’s Ecopetrol Permian LLC and Occidental Petroleum Corp. (Oxy) have agreed to extend the development plan of Rodeo Midland Basin LLC under the joint venture signed by the companies in July 2019. The agreement includes a plan to drill 34 wells in the Permian basin between April 2025 and June 2026, in addition to those being executed under the current development plan, Ecopetrol said in a release Feb 3. In 2019, the companies formed a joint venture to develop 97,000 net acres of Oxy’s Midland basin properties in the Texas counties of Midland, Martin, and Howard. Ecopetrol said the companies will keep active until 2027 an independent contract for development of the Delaware sub-basin. For 2025, Ecopetrol said its plan for Permian's Midland and Delaware sub-basins include drilling some 91 development wells through estimated investment of $885 million to produce an average of 90,000 boe/d net to Ecopetrol Permian. The companies said they will keep active an independent contract f..."
            },
            {
                "title": "Reconnaissance Energy confirms Namibian petroleum system",
                "link": "https://www.ogj.com/exploration-development/area-drilling/article/55264994/reconnaissance-energy-confirms-namibian-petroleum-system",
                "summary": "Reconnaissance Energy Africa Ltd. confirmed a working petroleum system with the Naingopo exploration well in the Damara Fold Belt in PEL 73, onshore Namibia.",
                "full_text": "Reconnaissance Energy Africa Ltd. confirmed a working petroleum system with the Naingopo exploration well in the Damara Fold Belt in PEL 73, onshore Namibia, and further drilling is planned to delineate the full extent of the Damara Fold Belt play. The well is the first of several to test the potential resource of the Damara Fold Belt to target large anticlinal structures with the purpose of achieving commercial levels of oil and natural gas production (OGJ Online, Nov. 27, 2024). The well reached a total depth of 4,184 m on Nov. 26, 2024. The primary objective in the Otavi above the main fault was not penetrated due to seismic uncertainties, however, the Otavi was penetrated at predicted depth below the main fault. The well proved the occurrence of both the Mulden and Otavi stratigraphy and encountered 52 m of net reservoir in the Otavi Group, with the Mulden reservoirs being tighter than expected. The Naingopo vertical seismic profile (VSP) correlated well results to the Otavi seismi..."
            },
            {
                "title": "GUPCO drills successful exploration well",
                "link": "https://www.ogj.com/exploration-development/discoveries/article/55264701/gupco-drills-successful-exploration-well",
                "summary": "Gulf of Suez Petroleum Co. (GUPCO) confirmed reserves with the East Crystal-1 exploratory well in an integrated concession area in the Gulf of Suez.",
                "full_text": "Gulf of Suez Petroleum Co. (GUPCO) confirmed reserves with the East Crystal-1 exploratory well in an integrated concession area in the Gulf of Suez. Initial testing of the 16-ft Hawara layer produced more than 2,000 b/d of crude oil and confirmed expected reserves of about 8 million bbl. The underlying honey layer beneath the Hawara formation which spans more than 100 ft has not yet been tested. GUPCO plans to drill two additional wells which will add more than 5,000 bo/d. The East Crystal-1 well is the second successful exploration well drilled using the latest seismic survey technology, the Ocean Bottom Node (OBN) seismic exploration, after the success of the S. El-Wasl-1 well. GUPCO is operator of Idfu field in the Gulf of Suez and is a joint venture between Dragon Oil and the Egyptian General Petroleum Corp. (EGPC). Alex Procyk is Upstream Editor at Oil & Gas Journal. He has also served as a principal technical professional at Halliburton and as a completion engineer at ConocoPhill..."
            }
        ]
    },
    "OGJ: Drilling and Production": {
        "feed_title": "Drilling & Production | Oil & Gas Journal",
        "feed_url": "https://www.ogj.com/__rss/website-scheduled-content.xml?input=%7B%22sectionAlias%22%3A%22drilling-production%22%7D",
        "entries": [
            {
                "title": "Chevron affiliate Tengizchevroil starts production at Tengiz Future Growth Project",
                "link": "https://www.ogj.com/drilling-production/production-operations/article/55263371/chevron-affiliate-tengizchevroil-starts-production-in-kazakhstan",
                "summary": "Chevron Corp. affiliate Tengizchevroil started oil production at its Future Growth Project at Tengiz oil field in western Kazakhstan.",
                "full_text": "Chevron Corp. affiliate Tengizchevroil LLP (TCO) started oil production at its Future Growth Project (FGP) at Tengiz oil field in western Kazakhstan. FGP is the third processing plant in operation at Tengiz field, which expands sour gas injection capability and is expected to ramp up output to 1 MMboe/d. Oil production at FGP follows completion of the wellhead pressure management project (WPMP) in 2024, which is designed to optimize the field and processing plants, the operator said. The FGP and WPMP projects together installed power systems at Tengiz with five Frame 9 gas turbine generators, added four large compression trains with additional pumping capacity, installed a new centralized control center and enhanced sour gas handling and reinjection to the field for long-term pressure maintenance. Tengiz ranks as the world’s deepest producing supergiant oil field and the largest single-trap producing reservoir in existence. The FGP expansion aims to increase crude oil production by 260..."
            }
        ]
    },
    "OGJ: Energy Transition": {
        "feed_title": "Energy Transition | Oil & Gas Journal",
        "feed_url": "https://www.ogj.com/__rss/website-scheduled-content.xml?input=%7B%22sectionAlias%22%3A%22energy-transition%22%7D",
        "entries": [
            {
                "title": "EPA grants West Virginia Class VI well primacy",
                "link": "https://www.ogj.com/general-interest/government/article/55262024/epa-grants-west-virginia-class-vi-well-primacy",
                "summary": "The US Environmental Protection Agency has granted West Virginia Class VI well primacy, allowing it to oversee and administer the well program for carbon capture, utilization, and storage in the state.",
                "full_text": "The US Environmental Protection Agency (EPA) has granted West Virginia primary enforcement responsibility of Class VI wells under the Underground Injection Control Program. The state is the fourth—after Louisiana, North Dakota, and Wyoming—given primary authority by EPA to oversee and administer its Class VI program, known as primacy. The authority allows the state to permit wells designed to inject carbon dioxide (CO2) into deep rock formations which serve as critical infrastructure for deploying carbon capture, utilization, and storage projects. US Senator Shelley Moore Capito (R-W.Va.), Chairman of the Senate Environment and Public Works (EPW) Committee, made the announcement Jan. 17. “I have frequently said that the states are better suited than Washington to carry out this authority and get these projects up and running. Carbon capture, utilization, and storage is essential to protecting our ability to provide reliable, baseload power in West Virginia through coal and natural gas,..."
            }
        ]
    },
    "Oil and Gas 360": {
        "feed_title": "Oil & Gas 360",
        "feed_url": "https://www.oilandgas360.com/feed/",
        "entries": [
            {
                "title": "U.S. clean energy firms lobby lawmakers to keep tax credits",
                "link": "https://www.oilandgas360.com/u-s-clean-energy-firms-lobby-lawmakers-to-keep-tax-credits/#utm_source=rss&utm_medium=rss&utm_campaign=u-s-clean-energy-firms-lobby-lawmakers-to-keep-tax-credits",
                "summary": "(Oil Price) &#8211; U.S. clean energy groups and hundreds of their member companies are beginning on Wednesday a series of meetings [&#8230;]",
                "full_text": "(Oil Price) – U.S. clean energy groups and hundreds of their member companies are beginning on Wednesday a series of meetings with members of Congress to lobby the Trump Administration to keep the tax credits from the Biden-era climate and infrastructure laws. President Donald Trump reversed most of Biden’s energy and climate policies on Day One, signing a series of executive orders to boost oil and gas production, expand areas for drilling, withdraw from the Paris Agreement (again), halt offshore wind permits until a review into the economics is made, and eliminate the so-called “electric vehicle (EV) mandate.” President Trump has also pledged to repeal Biden’s Inflation Reduction Act (IRA), which offers various tax credits to clean energy producers. The trade groups, representing more than 2,000 U.S. companies, are set to hold more than 100 meetings with lawmakers, in a “lobbying blitz” on tax credits, the Solar Energy Industries Association (SEIA) said on Wednesday. The clean energy..."
            },
            {
                "title": "Iran says U.S. sanctions will destabilise oil and energy markets",
                "link": "https://www.oilandgas360.com/iran-says-u-s-sanctions-will-destabilise-oil-and-energy-markets/#utm_source=rss&utm_medium=rss&utm_campaign=iran-says-u-s-sanctions-will-destabilise-oil-and-energy-markets",
                "summary": "(Investing) &#8211; DUBAI &#8211; Iran&#8217;s oil minister said imposing unilateral sanctions on crude producers would destabilise energy markets, the ministry&#8217;s SHANA [&#8230;]",
                "full_text": "(Investing) – DUBAI – Iran’s oil minister said imposing unilateral sanctions on crude producers would destabilise energy markets, the ministry’s SHANA news outlet reported on Wednesday, after U.S. President Donald Trump said he would seek to drive Tehran’s oil exports to zero. “Depoliticising the oil market is a vital issue for energy security. Imposing unilateral sanctions against major oil producers and putting pressure on OPEC will destabilise oil and energy markets as well as harm consumers around the world,” Mohsen Paknejad told OPEC Secretary General Haitham Al Ghais. Paknejad’s comments came after Trump restored his “maximum pressure” campaign on Iran that includes efforts to drive its oil exports down to zero in order to stop Tehran from obtaining a nuclear weapon. This campaign was first launched during Trump’s first term in 2018 and led to a sharp drop in Iranian oil exports to as little as 200,000 barrels per day in some months of 2020. Iranian oil exports then rebounded dur..."
            },
            {
                "title": "Colombian president cancels oil joint venture with U.S. company",
                "link": "https://www.oilandgas360.com/colombian-president-cancels-oil-joint-venture-with-u-s-company/#utm_source=rss&utm_medium=rss&utm_campaign=colombian-president-cancels-oil-joint-venture-with-u-s-company",
                "summary": "(Oil Price) &#8211; Colombia’s president, Gustavo Petro, has canceled a joint venture between state energy company Ecopetrol and Occidental Petroleum on [&#8230;]",
                "full_text": "(Oil Price) – Colombia’s president, Gustavo Petro, has canceled a joint venture between state energy company Ecopetrol and Occidental Petroleum on environmental concerns regarding hydraulic fracturing. Bloomberg reported that Petro had shared his concern on national TV, saying he was against a recent expansion of the deal between Ecopetrol and Oxy because it involved fracking, going counter to his energy policy efforts, which center on the transition away from hydrocarbons to alternative sources of energy. “I want that operation to be sold, and for the money to be invested in clean energies,” Petro said at a livestreamed cabinet meeting. “We are against fracking, because fracking is the death of nature, and the death of humanity.” The call to dismantle the joint venture comes barely a day after Ecopetrol announced the extension of the deal with Oxy, which is focused on the Permian Basin—the most prolific shale play in the United States, with hydraulic fracturing the standard practice i..."
            },
            {
                "title": "ADNOC to shift U.S. hydrogen, LNG assets in push to create $80 billion global venture",
                "link": "https://www.oilandgas360.com/adnoc-to-shift-u-s-hydrogen-lng-assets-in-push-to-create-80-billion-global-venture/#utm_source=rss&utm_medium=rss&utm_campaign=adnoc-to-shift-u-s-hydrogen-lng-assets-in-push-to-create-80-billion-global-venture",
                "summary": "(World Oil) &#8211; ADNOC will transfer stakes in some U.S. assets to its new international investment firm, XRG PJSC, part [&#8230;]",
                "full_text": "(World Oil) – ADNOC will transfer stakes in some U.S. assets to its new international investment firm, XRG PJSC, part of a push to create a $80 billion global venture. Abu Dhabi National Oil Co.’s holdings in a hydrogen venture with Exxon Mobil Corp. and NextDecade Corp.’s LNG export project will move to XRG, according to CEO Sultan Al Jaber. XRG aims to invest in technologies that power the energy transition and the shift to advanced technologies, Al Jaber wrote in a column on the news website Semafor. ADNOC in September agreed to take a 35% stake in Exxon’s proposed hydrogen project in Baytown, Texas, which is likely to be the world’s biggest once built. That was its second acquisition in the US after ADNOC in May agreed to buy a stake in NextDecade’s LNG project, also in Texas. ADNOC announced its plan for XRG last year, saying the company will have an enterprise value of over $80 billion and will aim to more than double the value of its assets over the next decade. Adnoc plans to s..."
            },
            {
                "title": "Japan may see LNG demand up if renewables are slow; Canada there to deliver, officials say",
                "link": "https://www.oilandgas360.com/japan-may-see-lng-demand-up-if-renewables-are-slow-canada-there-to-deliver-officials-say/#utm_source=rss&utm_medium=rss&utm_campaign=japan-may-see-lng-demand-up-if-renewables-are-slow-canada-there-to-deliver-officials-say",
                "summary": "(BOE Report) &#8211; Japan’s demand for liquefied natural gas (LNG) may grow by more than 10% to some 74 million [&#8230;]",
                "full_text": "(BOE Report) – Japan’s demand for liquefied natural gas (LNG) may grow by more than 10% to some 74 million metric tons by 2040 under a government scenario where the renewable energy rollout goes slower than expected, a senior industry ministry official said. Japan’s domestic LNG demand continued to fall last year, dropping by 0.4% to 66 million tons due to a weaker economy, a growing share of renewable energy, and nuclear power plant restarts. Yuya Hasegawa, a division director at Japan’s Ministry of Economy, Trade and Industry (METI), told a conference in Tokyo that there is an expectation that power demand will expand due to the growth of data centres in the country. “If we do not have a huge expansion of renewable energy, or if we cannot reduce the cost of hydrogen, ammonia, CCUS (carbon capture, utilization and storage), our gas demand will increase,” he said. According to Hasegawa, under an alternative energy strategy scenario being prepared by METI, Japan’s LNG demand will rise t..."
            }
        ]
    },
    "Shale": {
        "feed_title": "Shale Magazine",
        "feed_url": "https://shalemag.com/feed/",
        "entries": [
            {
                "title": "U.S. Energy Dominance: Leading in Oil, Gas, and Renewables",
                "link": "https://shalemag.com/us-energy-dominance-leadership/",
                "summary": "<p>The U.S. leads in oil, gas, and LNG exports, securing global energy dominance. Rapid growth in renewables and nuclear energy strengthens U.S. energy leadership. Innovation in drilling, carbon capture, and [&#8230;]</p>\n<p>The post <a href=\"https://shalemag.com/us-energy-dominance-leadership/\">U.S. Energy Dominance: Leading in Oil, Gas, and Renewables</a> appeared first on <a href=\"https://shalemag.com\">Shale Magazine</a>.</p>",
                "full_text": "President Donald Trump campaigned on the promise of “unleashing U.S. energy dominance,” but the reality is that the United States has already achieved this goal. Over the past decade, the U.S. has cemented its position as a global energy leader, excelling in production, innovation, and influence. Here’s a closer look at the evidence behind America’s energy dominance. Since 2018, the U.S. has been the world’s top oil producer, outpacing both Saudi Arabia and Russia. In 2023, U.S. crude oil plus condensate production averaged 12.9 million barrels per day (BPD), driven by the shale revolution. Technological advancements in hydraulic fracturing and horizontal drilling unlocked vast reserves in regions like the Permian Basin and Bakken Formation, transforming the U.S. into an energy superpower. Beyond crude oil, the U.S. also leads in broader categories, including natural gas liquids (NGLs). In 2023, the U.S. accounted for 15.6% of global oil production, with total output (including NGLs) r..."
            },
            {
                "title": "Trump Greenland Strategy: A Bold Move for Arctic Oil and Gas",
                "link": "https://shalemag.com/trump-greenland-strategy/",
                "summary": "<p>President-elect Donald Trump has expressed growing interest in acquiring Greenland, a Danish territory, to expand the United States’ sphere of influence, secure strategic positions in the Arctic, and solidify the [&#8230;]</p>\n<p>The post <a href=\"https://shalemag.com/trump-greenland-strategy/\">Trump Greenland Strategy: A Bold Move for Arctic Oil and Gas</a> appeared first on <a href=\"https://shalemag.com\">Shale Magazine</a>.</p>",
                "full_text": "President-elect Donald Trump has expressed growing interest in acquiring Greenland, a Danish territory, to expand the United States’ sphere of influence, secure strategic positions in the Arctic, and solidify the region’s trade and security potential. Greenland’s Arctic location provides strategic proximity to shipping routes, making it a valuable economic waypoint for the Danes. Its acquisition by the United States could be an economic boon in terms of resource potential, with its untapped reserves of oil, gas, and rare minerals that could stimulate economic growth and further energy independence. Despite Denmark’s initial resistance to the acquisition, the incoming president has garnered growing support from House Republicans and Greenlanders themselves. Why does President-elect Trump want Greenland under the United States’ authority, and is it even a possibility? Acquiring the world’s largest non-continental island may be more viable than you think. Although many have dismissed the ..."
            },
            {
                "title": "U.S. Energy Policy: Chevron and ExxonMobil’s Stance",
                "link": "https://shalemag.com/big-oil-us-energy-policy/",
                "summary": "<p>The CEOs of several oil majors are seeking greater continuity in a sea of change. The Covid-19 pandemic and the acceleration of a green transition in the United States, under [&#8230;]</p>\n<p>The post <a href=\"https://shalemag.com/big-oil-us-energy-policy/\">U.S. Energy Policy: Chevron and ExxonMobil&#8217;s Stance</a> appeared first on <a href=\"https://shalemag.com\">Shale Magazine</a>.</p>",
                "full_text": "The CEOs of several oil majors are seeking greater continuity in a sea of change. The Covid-19 pandemic and the acceleration of a green transition in the United States, under the Biden Administration, have led to structural changes in the energy industry. Oil and gas companies have had to respond to challenges, including political and geopolitical issues, that have led many firms to change their long-term strategies. Most major fossil fuel companies now include renewable energy or clean tech projects in their portfolios and plan to diversify beyond oil and gas in the coming decades. This has resulted in Big Oil becoming increasingly wary of the shift that a change in leadership, from Biden to Donald Trump, could bring. Mike Wirth, the CEO of Chevron, has spoken in favor of the development of a strong renewable energy sector, alongside continued fossil fuel output, to ensure U.S. energy security. Wirth recently stated that the energy transition is “going to take longer than people would..."
            }
        ]
    },
    "MEES": {
        "feed_title": "Latest Issue | Data Driven Middle East Oil & Gas Analysis",
        "feed_url": "https://www.mees.com/latest-issue/rss",
        "entries": [
            {
                "title": "Egypt Eyes Deals To Tap Output  From Cyprus’ Cronos & Aphrodite Fields",
                "link": "https://www.mees.com/2025/1/31/oil-gas/egypt-eyes-deals-to-tap-output-from-cyprus-cronos-aphrodite-fields/ffc26340-dfde-11ef-a5d9-43bbd00ed02c",
                "summary": "Egypt is desperately trying to secure as much regional gas as possible. While nothing has been signed yet Cairo hopes to convince Cyprus and...",
                "full_text": "Egypt is set to sign two deals on 17 February in Cairo that it hopes will help it secure gas from the two offshore Cyprus gas discoveries that are closest to development: Chevron-operated 3.5tcf Aphrodite, and Eni-operated 2.5tcf Cronos. Egypt’s Petroleum Ministry expects to sign a Host Government Agreement (HGA) with Eni and 50:50 partner TotalEnergies which envisages the export of all Cronos output as LNG from the Eni-operated Segas facility at Damietta on the country’s Mediterranean coast. (CONTINUED - 793 WORDS) 31 Jan, 2025 31 Jan, 2025 31 Jan, 2025 31 Jan, 2025 31 Jan, 2025 31 Jan, 2025 31 Jan, 2025 31 Jan, 2025 24 Jan, 2025 Keep abreast with current events with our weekly headlines.You’ll also be notified of our free articles & maps. By signing up, you agree to receive promotional emails. You can unsubscribe at any time. For more information, read our privacy statement."
            },
            {
                "title": "Israel Gas Output Hits Record 2.6bn cfd  For 2024; Energean Eyes 2H25 Karish Boost",
                "link": "https://www.mees.com/2025/1/31/oil-gas/israel-gas-output-hits-record-26bn-cfd-for-2024-energean-eyes-2h25-karish-boost/7caa41b0-dfdf-11ef-81a1-d9f76bbab957",
                "summary": "*Israel gas output increased for the fifth consecutive year to post a new annual record of 2.614bn cfd for 2024, up 10% year-on-year, accord...",
                "full_text": "*Israel gas output increased for the fifth consecutive year to post a new annual record of 2.614bn cfd for 2024, up 10% year-on-year, according to data obtained by MEES. Output from US major Chevron’s two key fields, the 23tcf Leviathan and 14tcf Tamar, was up 3% at 1.094bn cfd and 10% at 973mn cfd respectively. *Both fields supply the domestic market and also export gas to Jordan and Egypt. Egypt’s imports of Israeli gas surged by 18% year-on-year to a record 981mn cfd for 2024, with record monthly volumes of 1.065bn cfd in April and December (MEES, 17 January). This came as Egypt looked to hoover up as much gas as possible amid a domestic gas output crunch: 2024 also saw seven-year high LNG imports of 2.78mn tons (MEES, 10 January). (CONTINUED - 689 WORDS) 31 Jan, 2025 17 Jan, 2025 29 Nov, 2024 29 Nov, 2024 29 Nov, 2024 8 Nov, 2024 11 Oct, 2024 27 Sep, 2024 13 Sep, 2024 Keep abreast with current events with our weekly headlines.You’ll also be notified of our free articles & maps. By ..."
            },
            {
                "title": "Abu Dhabi’s Lunate To Buy Snam Stake  In Domestic Gas Pipeline Network",
                "link": "https://www.mees.com/2025/1/31/corporate/abu-dhabis-lunate-to-buy-snam-stake-in-domestic-gas-pipeline-network/e41886d0-dfdf-11ef-8d09-3d5a5143e0aa",
                "summary": "Abu Dhabi’s Lunate has doubled down on investments in the domestic midstream with the planned purchase of a stake in Adnoc Gas Pipelines fro...",
                "full_text": "Abu Dhabi investment firm Lunate is expanding its presence in the emirate’s midstream hydrocarbons sector, with a planned investment in Adnoc Gas Pipelines. Lunate announced on 28 January that it is purchasing an effective stake of 5.87% in the midstream entity from Italian pipeline operator Snam, following a deal last year which saw it invest in Adnoc Oil Pipelines (MEES, 12 April 2024). Adnoc Gas Pipelines was established in 2020 and has lease rights from Adnoc for 38 pipelines covering 982km, connecting Adnoc’s upstream assets with domestic offtakers. The deal raised $10.1bn for Adnoc, with Adnoc Gas Pipelines leasing the rights to the pipeline for a period of 20 years “in return for a volume-based tariff subject to a floor and a cap” (MEES, 26 June 2020). The transaction valued Adnoc Gas Pipelines at $20.7bn. (CONTINUED - 708 WORDS) 31 Jan, 2025 24 Jan, 2025 24 Jan, 2025 24 Jan, 2025 17 Jan, 2025 10 Jan, 2025 10 Jan, 2025 3 Jan, 2025 20 Dec, 2024 Keep abreast with current events wi..."
            }
        ]
    },
    "Egypt Oil and Gas": {
        "feed_title": "News | Egypt Oil & Gas",
        "feed_url": "https://egyptoil-gas.com/news/feed/",
        "entries": [
            {
                "title": "Iran to Sign $17B Contracts For South Pars Gas Field Pressure Boost Project",
                "link": "https://egyptoil-gas.com/news/iran-to-sign-17b-contracts-for-south-pars-gas-field-pressure-boost-project/?utm_source=rss&utm_medium=rss&utm_campaign=iran-to-sign-17b-contracts-for-south-pars-gas-field-pressure-boost-project",
                "summary": "<p>National Iranian Oil Company (NIOC) is set to sign seven contracts for the South Pars (SP) pressure boost project valued at $17 billion, said the company’s Engineering and Development Manager, Reza Dehqa. This follows the completion of preliminary studies and the signing of initial agreements with four main contractors last year, worth up to $400 [&#8230;]</p>\n<p>The post <a href=\"https://egyptoil-gas.com/news/iran-to-sign-17b-contracts-for-south-pars-gas-field-pressure-boost-project/\">Iran to Sign $17B Contracts For South Pars Gas Field Pressure Boost Project</a> first appeared on <a href=\"https://egyptoil-gas.com\">Egypt Oil & Gas</a>.</p>",
                "full_text": "National Iranian Oil Company (NIOC) is set to sign seven contracts for the South Pars (SP) pressure boost project valued at $17 billion, said the company’s Engineering and Development Manager, Reza Dehqa. This follows the completion of preliminary studies and the signing of initial agreements with four main contractors last year, worth up to $400 million, Dehqan added. Dehghan warned that without timely intervention, this pressure drop could have serious implications for Iran’s energy security and economy. Notably, South Pars gas fields supply 70% of the country’s domestic gas needs in addition to industrial, and power plant gas consumption. The field also covers 40% of the Iran’s gasoline needs. Doaa is a staff writer with a Bachelor's Degree in Mass Communication, majoring Journalism from Ahram Canadian University. She has 2-3 years of experience in copywriting, and content creation. Get all latest content delivered to your email a few times a month. © 2025 EOG all rights reserved We..."
            },
            {
                "title": "Oman Sees 5.1% Drop in Oil Production, 4.9% Rise in Natural Gas Imports, Production in 2024",
                "link": "https://egyptoil-gas.com/news/oman-sees-5-1-drop-in-oil-production-4-9-rise-in-natural-gas-imports-production-in-2024/?utm_source=rss&utm_medium=rss&utm_campaign=oman-sees-5-1-drop-in-oil-production-4-9-rise-in-natural-gas-imports-production-in-2024",
                "summary": "<p>Oman reported a 308,422,100 barrels of oil exports by the end of December 2024, a slight drop from 310,331,200 barrels recorded in the same period last year, according to Oman news agency. The country reached total oil production of 363,288,500 barrels at the end of December 2024, a 5.1% drop from 382,770,200 barrels in 2023. [&#8230;]</p>\n<p>The post <a href=\"https://egyptoil-gas.com/news/oman-sees-5-1-drop-in-oil-production-4-9-rise-in-natural-gas-imports-production-in-2024/\">Oman Sees 5.1% Drop in Oil Production, 4.9% Rise in Natural Gas Imports, Production in 2024</a> first appeared on <a href=\"https://egyptoil-gas.com\">Egypt Oil & Gas</a>.</p>",
                "full_text": "Oman reported a 308,422,100 barrels of oil exports by the end of December 2024, a slight drop from 310,331,200 barrels recorded in the same period last year, according to Oman news agency. The country reached total oil production of 363,288,500 barrels at the end of December 2024, a 5.1% drop from 382,770,200 barrels in 2023. The crude oil production was 278,019,200 barrels, while condensate production amounted to 85,269,300 barrels. Notably, China led the list of countries importing oil from Oman, with total exports reaching 289,216,800 barrels, an increase of 1.3% from the end of December 2023. South Korea followed with 5,769,700 barrels, up by 10.6%, then Japan with 5,656,600 barrels, down by 39.7%, and India with 3,004,000 barrels, up by 10.6%. On the other hand, Oman’s total domestic production and import of natural gas reached 56,542,400 billion cubic meters (bcm) by the end of December 2024, marking a 4.9% increase compared to the same period last year, which stood at 53,925 bcm..."
            },
            {
                "title": "India Allocates $647M for Strategic Oil Reserves Amid Global Supply Concerns",
                "link": "https://egyptoil-gas.com/news/india-allocates-647m-for-strategic-oil-reserves-amid-global-supply-concerns/?utm_source=rss&utm_medium=rss&utm_campaign=india-allocates-647m-for-strategic-oil-reserves-amid-global-supply-concerns",
                "summary": "<p>India has allocated 55.97 billion rupees ($646.78 million) to purchase oil for its strategic petroleum reserves (SPRs) for the fiscal years 2025-26, amid global supply uncertainties, according to Reuters. The Indian Strategic Petroleum Reserve Ltd (ISPRL), which manages the federal oil inventories, currently operates three SPRs in southern India with a combined capacity of approximately [&#8230;]</p>\n<p>The post <a href=\"https://egyptoil-gas.com/news/india-allocates-647m-for-strategic-oil-reserves-amid-global-supply-concerns/\">India Allocates $647M for Strategic Oil Reserves Amid Global Supply Concerns</a> first appeared on <a href=\"https://egyptoil-gas.com\">Egypt Oil & Gas</a>.</p>",
                "full_text": "India has allocated 55.97 billion rupees ($646.78 million) to purchase oil for its strategic petroleum reserves (SPRs) for the fiscal years 2025-26, amid global supply uncertainties, according to Reuters. The Indian Strategic Petroleum Reserve Ltd (ISPRL), which manages the federal oil inventories, currently operates three SPRs in southern India with a combined capacity of approximately 5 million tons. A portion of this capacity is utilized for commercial operations by companies such as Abu Dhabi National Oil Co (ADNOC). Besides oil purchase, the budget includes 1.8 billion rupees for the operation and maintenance of the SPRs and 3.35 billion rupees for the purchase of land and construction of new storage caverns. These investments are part of India’s broader strategy to expand its SPR capacity, given that the country imports over 80% of its oil needs and is the world’s third-largest oil importer and consumer. ISPRL has has sought interest from private companies in building and operati..."
            },
            {
                "title": "bp to Invest Up to $25B in Kirkuk Fields",
                "link": "https://egyptoil-gas.com/news/bp-to-invest-up-to-25b-in-kirkuk-fields/?utm_source=rss&utm_medium=rss&utm_campaign=bp-to-invest-up-to-25b-in-kirkuk-fields",
                "summary": "<p>bp plans to spend between $20 to $25 billion over the lifetime of a project to redevelop four Kirkuk oil and gas fields through a profit-sharing agreement that would last more than 25 years, a senior Iraqi oil official told Reuters. This came as part of Iraq’s efforts to return back the foreign investment. Once [&#8230;]</p>\n<p>The post <a href=\"https://egyptoil-gas.com/news/bp-to-invest-up-to-25b-in-kirkuk-fields/\">bp to Invest Up to $25B in Kirkuk Fields</a> first appeared on <a href=\"https://egyptoil-gas.com\">Egypt Oil & Gas</a>.</p>",
                "full_text": "bp plans to spend between $20 to $25 billion over the lifetime of a project to redevelop four Kirkuk oil and gas fields through a profit-sharing agreement that would last more than 25 years, a senior Iraqi oil official told Reuters. This came as part of Iraq’s efforts to return back the foreign investment. Once the deal is signed, which it is expected to be over the coming weeks according to the official, it would be a great progress for Iraq. The official said to Reuters “the technical and economic negotiations were progressing well, and final contracts could be signed in the first half of February and possibly by the end of this week.” Under the terms of the contract, bp would boost crude production capacity from the four oilfields in Kirkuk by 150,000 barrels per day (bbl/d) to raise total capacity to at least 450,000 bbl/d in 2-3 years, the official said. Under the profit-sharing agreement that is being discussed, the senior oil official said bp would be able to recover costs and s..."
            },
            {
                "title": "Initiatives to Support Natural Gas as Car Fuel to be Launched Soon: Kouchouk",
                "link": "https://egyptoil-gas.com/news/initiatives-to-support-natural-gas-as-car-fuel-to-be-launched-soon-kouchouk/?utm_source=rss&utm_medium=rss&utm_campaign=initiatives-to-support-natural-gas-as-car-fuel-to-be-launched-soon-kouchouk",
                "summary": "<p>Minister of Finance Ahmed Kouchouk stated that the Ministry of Finance is committed to supporting local and foreign businesses in expanding green project financing to drive sustainable growth. To encourage the adoption of greener and more economical transportation options, initiatives to support the use of natural gas and electric vehicles in cars and buses are [&#8230;]</p>\n<p>The post <a href=\"https://egyptoil-gas.com/news/initiatives-to-support-natural-gas-as-car-fuel-to-be-launched-soon-kouchouk/\">Initiatives to Support Natural Gas as Car Fuel to be Launched Soon: Kouchouk</a> first appeared on <a href=\"https://egyptoil-gas.com\">Egypt Oil & Gas</a>.</p>",
                "full_text": "Minister of Finance Ahmed Kouchouk stated that the Ministry of Finance is committed to supporting local and foreign businesses in expanding green project financing to drive sustainable growth. To encourage the adoption of greener and more economical transportation options, initiatives to support the use of natural gas and electric vehicles in cars and buses are soon to be launched. Kouchouk’s statement came during his participation in the Banking and Finance Committee meeting at Chapter Zero Egypt. The Ministry always looks forward to dialogue with representatives of the private sector and international institutions at one table, to think together about a more sustainable economic future, Kouchouk noted. Sarah has been writing in the oil and gas field for 8 years. She has a Bachelor Degree in English Literature. She has three years of experience in the banking sector. Get all latest content delivered to your email a few times a month. © 2025 EOG all rights reserved Welcome! Login in to..."
            }
        ]
    },
    "DIC Oil": {
        "feed_title": "DIC OIL TOOLS",
        "feed_url": "https://dicoiltools.wordpress.com/feed/",
        "entries": [
            {
                "title": "DIC Oil Tools: Your Trusted Source for Drill Pipe Protectors",
                "link": "https://dicoiltools.wordpress.com/2024/07/31/dic-oil-tools-your-trusted-source-for-drill-pipe-protectors/",
                "summary": "Dedicated Impex FZE, operating under the brand DIC Oil Tools, provides high-quality thread protectors and oil-related products. Their drill pipe protectors shield pipes from damage, corrosion, and thread issues, ensuring safety and cost-effectiveness in drilling operations. These protectors are made from materials like polyethylene, rubber, steel, and advanced composites, offering various advantages in the oil and gas industry.",
                "full_text": "DIC OIL TOOLS dicoiltools Dedicated Impex FZE is a provider of Drill Pipe Protectors and operates under the brand name DIC Oil Tools. We offer a comprehensive range of thread protectors and other oil-related products, all meeting the industry’s highest quality standards. DIC products have earned ISO and API certifications. Our commitment to customer satisfaction involves providing top-quality products and services. Our core principles are honesty and responsibility in all customer interactions. Drill pipe protectors are generally fitted around the ends of drill pipes and tubing to minimize end contact and prevent damage. These protective products are essential during the installation and transportation of steel pipes and see frequent use in the oil, gas, and water drilling sectors. Drill pipes feature threading at both ends and are divided into segments called tool joints. Drill pipe protectors play a crucial role in ensuring the safety and integrity of drill pipes during storage, tran..."
            },
            {
                "title": "The Crucial Role of Plastic Thread Protectors in Ensuring Project Success",
                "link": "https://dicoiltools.wordpress.com/2024/07/13/the-crucial-role-of-plastic-thread-protectors-in-ensuring-project-success/",
                "summary": "DIC Oil Tools supplies premium plastic thread protectors designed to safeguard oilfield tubular joints during transport, storage, and handling. These protectors ensure the integrity of threaded pipe ends, preventing damage from accidental impacts, corrosive environments, and contamination. Made from durable materials, they offer easy installation and customization for specific industry needs.",
                "full_text": "DIC OIL TOOLS dicoiltools DIC is a Supplier of Plastic Thread Protectors. DIC Oil Tools is a Brand by a Dedicated Impex Company. We ensure that our customers are satisfied with the quality of the products delivered. DIC all products passed the API Certification and ISO Certifications. All our products are forged from the highest quality raw material and tested various times under technical guidance. Oilfield tubular joints face various challenges during transport, storage, and handling before well installation. The threaded pipe ends, often featuring premium threads, must endure accidental impacts during loading from the mill to the wellsite, as well as during on-site cleaning and inspection. Additionally, these threaded ends are frequently exposed to corrosive environments while in storage. Premium connections, unlike regular ones, utilize precisely engineered threads and meticulously constructed seals within tight tolerances. The sealing mechanism is achieved through the interference..."
            },
            {
                "title": "Exploring the World of Drill Pipes: Vital Components in Oil and Gas Exploration",
                "link": "https://dicoiltools.wordpress.com/2024/07/10/exploring-the-world-of-drill-pipes-vital-components-in-oil-and-gas-exploration/",
                "summary": "DIC Oil Tools is a leading supplier of durable and reliable drill pipes for the oil and gas industry. These essential components, made from high-strength steel alloy, play a vital role in transmitting torque, providing a conduit for drilling fluid, and supporting downhole tools. DIC's expertise, commitment to quality, innovation, and global presence make them a top choice for customized, high-performance drill pipes. As technology and environmental challenges evolve, the significance of drill pipes in energy production is undeniable. Choosing DIC Oil Tools ensures dependable sealing solutions for long-term well performance in the most demanding drilling environments.",
                "full_text": "DIC OIL TOOLS dicoiltools DIC Oil Tools is one of the leading Suppliers of Drill Pipes for the oil and gas industry. The Company builds all the equipment using cutting-edge technology and high-quality, reliable, and durable materials. DIC has a longstanding reputation as a top manufacturer and supplier of pipe protection equipment. Keep reading to learn more about this system and the benefits you’ll see. At DIC Oil Tools, we only use the most durable materials available for OCTG and drill pipe manufacturers. Our premium materials and construction ensure that your system will be operational for years to come. Drill pipes are the unsung heroes of the oil and gas industry, essential in the exploration and extraction of fossil fuels from deep within the earth. Let’s delve into what makes drill pipes so crucial and how they contribute to this complex process. What Are Drill Pipes? Drill pipes are long, hollow steel tubes that form a key part of the drill string used in drilling rigs. They c..."
            },
            {
                "title": "Innovative Solutions for Thread Protection in the Oil and Gas Industry",
                "link": "https://dicoiltools.wordpress.com/2024/04/01/how-thread-protectors-prevent-damage-and-downtime-on-projects/",
                "summary": "DIC Oil Tools specializes in supplying and exporting thread protectors worldwide. These protectors help preserve the quality of threaded pipe ends, essential for withstanding impacts and corrosive storage conditions. By following guidelines for optimal use, such as proper selection and regular inspection, users can ensure efficient and effective protection. Additionally, the company also highlights the benefits of recycling thread protectors for environmental conservation.",
                "full_text": "DIC OIL TOOLS dicoiltools DIC Oil Tools is a Supplier and Exporter of Thread Protectors Worldwide. Our team is dedicated to understanding customer needs to ensure exceptional services and best solutions. DIC is committed to providing innovative products best suited to the needs of our customers and meeting their expectations in terms of functionality and value. Threaded pipe ends are often made with high-quality threads and are designed to survive repeated unintentional impacts during loading from the mill to the well, as well as during well-site clean-up and inspection. These threaded ends are frequently exposed to corrosive conditions while being stored. It is crucial to utilize a line pipe protector when installing a pipe. Using these easy protectors on jobs in the oil and gas industry will save money, time, and difficulties. When a pipe is being transported or stored, thread protectors shield the threads at the end. Usually composed of steel or plastic, they keep them free from dus..."
            },
            {
                "title": "Exploring the Various Applications of Drill Collars in Drilling Operations",
                "link": "https://dicoiltools.wordpress.com/2024/01/29/different-types-of-drill-collars-in-the-oil-and-gas-industry/",
                "summary": "DIC Oil Tools, a leading supplier in the Oil &#38; Gas industry, offers a complete range of high-quality OCTG and Accessories. The drill collar, a crucial component, stabilizes and adds weight for efficient drilling. DIC provides slick and spiral types, each suitable for different drilling conditions. Technical specs include materials, standards, and special features. Contact info@dic-oiltools.com for more information.",
                "full_text": "DIC OIL TOOLS dicoiltools DIC is one of the leading Suppliers of the highest-quality products for the Oil & Gas Industry. DIC Oil Tools is a Brand by a Dedicated Impex Company. We supply the complete range of OCTG and Accessories and other oil requirements with the highest quality standards in the industry. DIC all products pass the ISO and API Certification. What Does Drill Collar Mean? A drill collar is a drill string component that is used to provide weight on the bit for drilling purposes. The weight of the drill collar helps stabilize the drill and keeps the drill in tension, thereby increasing the cutting efficiency of the bit. Drill collars are usually constructed from thick-walled carbon steel, but can also consist of nonmagnetic steel, copper and other metal alloys. The drill collar is typically 30 to 90 feet long and threaded at both ends, male at one end and female at the other, to allow multiple drill collars to be joined above the bit assembly. The number of drill collars ..."
            }
        ]
    },
    "Permian Basin": {
        "feed_title": "Permian Basin Oil and Gas Magazine",
        "feed_url": "http://pboilandgasmagazine.com/feed/",
        "entries": [
            {
                "title": "Upstream employment in Texas declines in December after 6 months of growth",
                "link": "https://pboilandgasmagazine.com/upstream-employment-in-texas-declines-in-december-after-6-months-of-growth/",
                "summary": "<p>Data from U.S. Bureau of Labor Statistics and Texas Independent Producers and Royalty Owners Association show a decline in upstream employment in the industry in Texas in December.  TIPRO said upstream employment in the state in December was 195,500 – a decrease of 700 positions from November (500 in oil and gas extraction, 200 in [&#8230;]</p>\n<p>The post <a href=\"https://pboilandgasmagazine.com/upstream-employment-in-texas-declines-in-december-after-6-months-of-growth/\">Upstream employment in Texas declines in December after 6 months of growth</a> appeared first on <a href=\"https://pboilandgasmagazine.com\">Permian Basin Oil and Gas Magazine</a>.</p>",
                "full_text": "Permian Basin Oil and Gas Magazine PBOG is the Official Publication of the Permian Basin Petroleum Association and is published monthly by Zachry Publications, LP. February 4, 2025 by PBOG Leave a Comment Data from U.S. Bureau of Labor Statistics and Texas Independent Producers and Royalty Owners Association show a decline in upstream employment in the industry in Texas in December. TIPRO said upstream employment in the state in December was 195,500 – a decrease of 700 positions from November (500 in oil and gas extraction, 200 in services). The decline followed six straight months of growth in Texas upstream employment. Ed Longanecker, president of TIPRO, said Jan. 24, “Our industry looks forward to returning to some level of normalcy from a federal policy perspective under the new administration, including supporting the expedited expansion of energy infrastructure. Demand for reliable and affordable energy will increase exponentially in the coming years, and Texas producers will ris..."
            },
            {
                "title": "Chris Wright confirmed as energy secretary in Trump administration",
                "link": "https://pboilandgasmagazine.com/chris-wright-confirmed-as-energy-secretary-in-trump-administration/",
                "summary": "<p>Chris Wright, CEO of Denver-based Liberty Energy, was confirmed by the U.S. Senate Monday as secretary of energy in the new administration of President Donald Trump.  Wright, 60, has been chair and CEO of Liberty since 2011.  A graduate of MIT, he founded Pinnacle Technologies and later served as chairman of Stroud Energy.  He was [&#8230;]</p>\n<p>The post <a href=\"https://pboilandgasmagazine.com/chris-wright-confirmed-as-energy-secretary-in-trump-administration/\">Chris Wright confirmed as energy secretary in Trump administration</a> appeared first on <a href=\"https://pboilandgasmagazine.com\">Permian Basin Oil and Gas Magazine</a>.</p>",
                "full_text": "Permian Basin Oil and Gas Magazine PBOG is the Official Publication of the Permian Basin Petroleum Association and is published monthly by Zachry Publications, LP. February 4, 2025 by PBOG Leave a Comment Chris Wright, CEO of Denver-based Liberty Energy, was confirmed by the U.S. Senate Monday as secretary of energy in the new administration of President Donald Trump. Wright, 60, has been chair and CEO of Liberty since 2011. A graduate of MIT, he founded Pinnacle Technologies and later served as chairman of Stroud Energy. He was confirmed by a vote of 59-38. Wright said he would sever all ties across the industry. Filed Under: PBOG Newsletter Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Subscribe: Newsletter | Magazine Read the most recent issue of PBOG on your computer, iPad, Kindle, phone or other electronic reader. If you'd like to view our previ..."
            },
            {
                "title": "Permian Basin drives increase in natural gas production, but demand grows faster",
                "link": "https://pboilandgasmagazine.com/permian-basin-drives-increase-in-natural-gas-production-but-demand-grows-faster/",
                "summary": "<p>U.S. Energy Information Administration expects Henry Hub natural gas price to increase in 2025 and 2026 as demand for natural gas grows faster than supply.  There is more demand from U.S. LNG export facilities which reduces natural gas in storage compared with the last two years.  EIA said Jan. 23 it expects U.S. benchmark Henry [&#8230;]</p>\n<p>The post <a href=\"https://pboilandgasmagazine.com/permian-basin-drives-increase-in-natural-gas-production-but-demand-grows-faster/\">Permian Basin drives increase in natural gas production, but demand grows faster</a> appeared first on <a href=\"https://pboilandgasmagazine.com\">Permian Basin Oil and Gas Magazine</a>.</p>",
                "full_text": "Permian Basin Oil and Gas Magazine PBOG is the Official Publication of the Permian Basin Petroleum Association and is published monthly by Zachry Publications, LP. February 4, 2025 by PBOG Leave a Comment U.S. Energy Information Administration expects Henry Hub natural gas price to increase in 2025 and 2026 as demand for natural gas grows faster than supply. There is more demand from U.S. LNG export facilities which reduces natural gas in storage compared with the last two years. EIA said Jan. 23 it expects U.S. benchmark Henry Hub natural gas spot price to increase in 2025 to average $3.10 per million British thermal units and in 2026 to average $4.00 per MMBtu from record lows in 2024. EIA said increases in 2025 in demand – which includes domestic natural gas consumption and exports – will exceed increases in supply, including domestic natural gas production and imports. U.S. demand for natural gas increases in 2025 by 3.2 Bcfd and in 2026 by an additional 2.6 Bcfd. Dry natural gas p..."
            },
            {
                "title": "Atlas Energy acquires distributed power system in Permian from Moser Energy",
                "link": "https://pboilandgasmagazine.com/atlas-energy-acquires-distributed-power-system-in-permian-from-moser-energy/",
                "summary": "<p>Austin-based Atlas Energy Solutions said last week it agreed to purchase Moser Energy Systems, a provider of distributed power solutions, in a cash and stock transaction valued at $220 million ($180 million cash).  Atlas said the combination of its completion platform and Moser’s distributed power platform creates “an innovative, diversified energy solutions provider with a [&#8230;]</p>\n<p>The post <a href=\"https://pboilandgasmagazine.com/atlas-energy-acquires-distributed-power-system-in-permian-from-moser-energy/\">Atlas Energy acquires distributed power system in Permian from Moser Energy</a> appeared first on <a href=\"https://pboilandgasmagazine.com\">Permian Basin Oil and Gas Magazine</a>.</p>",
                "full_text": "Permian Basin Oil and Gas Magazine PBOG is the Official Publication of the Permian Basin Petroleum Association and is published monthly by Zachry Publications, LP. February 4, 2025 by PBOG Leave a Comment Austin-based Atlas Energy Solutions said last week it agreed to purchase Moser Energy Systems, a provider of distributed power solutions, in a cash and stock transaction valued at $220 million ($180 million cash). Atlas said the combination of its completion platform and Moser’s distributed power platform creates “an innovative, diversified energy solutions provider with a leading portfolio of proppant, logistics (including Dune Express) and distributed power solutions.” The transaction “increases Atlas’ customer reach with a vital power service offering in Atlas’ core geography (Permian Basin) while providing geographic diversity with operating locations in key oil and gas basins across the central U.S.” John Turner, president and CEO of Atlas, said Jan. 27, “This acquisition diversi..."
            },
            {
                "title": "U.S., Permian Basin reverse eight-week decline by adding drilling rigs",
                "link": "https://pboilandgasmagazine.com/u-s-permian-basin-reverse-eight-week-decline-by-adding-drilling-rigs/",
                "summary": "<p>Permian Basin and U.S. added drilling rigs last week for the first time in eight weeks, according to the weekly report of Jan. 31 from Baker Hughes.  There were 303 rigs in Permian Basin (up 5 in the past week, down 8 in the past year) and 582 in U.S. (up 6 in the past [&#8230;]</p>\n<p>The post <a href=\"https://pboilandgasmagazine.com/u-s-permian-basin-reverse-eight-week-decline-by-adding-drilling-rigs/\">U.S., Permian Basin reverse eight-week decline by adding drilling rigs</a> appeared first on <a href=\"https://pboilandgasmagazine.com\">Permian Basin Oil and Gas Magazine</a>.</p>",
                "full_text": "Permian Basin Oil and Gas Magazine PBOG is the Official Publication of the Permian Basin Petroleum Association and is published monthly by Zachry Publications, LP. February 4, 2025 by PBOG Leave a Comment Permian Basin and U.S. added drilling rigs last week for the first time in eight weeks, according to the weekly report of Jan. 31 from Baker Hughes. There were 303 rigs in Permian Basin (up 5 in the past week, down 8 in the past year) and 582 in U.S. (up 6 in the past week, down 37 in past year). Those are the first increases since Dec. 6. Also, New Mexico added 4 rigs for a new total of 106 (up 8 in past year), and the Texas count was flat at 277 (down 26 in past year). Eagle Ford in south Texas remains No. 2 among regions with 46 (up 1 in past week, down 6 in past year) followed by Williston with 34 (up 1 in past week, unchanged from a year ago), Haynesville with 28 (down 1 in past week, down 12 in past year) and Marcellus with 23 (unchanged in past week, down 6 in past year). Among..."
            }
        ]
    },
    "Oil and Gas Magazine": {
        "feed_title": "Oil & Gas Magazine",
        "feed_url": "https://www.oilandgasmagazine.com.mx/feed/",
        "entries": [
            {
                "title": "Producción nacional de petróleo cae 11.23% en diciembre",
                "link": "https://oilandgasmagazine.com.mx/2025/02/produccion-nacional-de-petroleo-cae-11-23-en-diciembre/?utm_source=rss&utm_medium=rss&utm_campaign=produccion-nacional-de-petroleo-cae-11-23-en-diciembre",
                "summary": "En septiembre, la producción de crudo en México registró una caída anual del 11.23%. La extracción de gas natural frenó las fuertes caídas que arrastraba.",
                "full_text": "© Depositphotos La producción nacional de petróleo crudo en México durante septiembre promedió 1.443 millones de barriles diarios, lo que representó un ligero descenso mensual de 0.35%, equivalente a 5 mil barriles diarios adicionales, de acuerdo con la información estadística de la CNH. Sin embargo, en términos anuales, la producción disminuyó un 11.23%, con una baja de 177 mil barriles en comparación con los 1.625 millones reportados en el mismo mes de 2023. Según el reporte de la Comisión Nacional de Hidrocarburos (CNH), que incluye información de Petróleos Mexicanos (Pemex) y otros operadores, la extracción total de hidrocarburos líquidos —que contempla crudo, condensados y líquidos del gas natural— ascendió a 1.697 millones de barriles por día. Este volumen mostró una disminución mensual de 0.76%, aunque presentó una reducción anual del 10.83%. La producción de condensados, fue de 255 mil barriles diarios, con una disminución mensual de 1.54% y una reducción anual del 8.27%. Los c..."
            }
        ]
    },
    "BOE Report": {
        "feed_title": "BOE Report",
        "feed_url": "https://boereport.com/feed/",
        "entries": [
            {
                "title": "US Energy Secretary derides net-zero policies in new order",
                "link": "https://boereport.com/2025/02/05/us-energy-secretary-derides-net-zero-policies-in-new-order/",
                "summary": "The U.S. Department of Energy will prioritize expanding energy production over achieving net-zero greenhouse gas emissions, according to an order issued on Wednesday by Energy Secretary Chris Wright. The secretarial order is meant to align the department with priorities outlined by President Donald Trump, who has called climate change a hoax and has vowed to <a class=\"read-more\" href=\"https://boereport.com/2025/02/05/us-energy-secretary-derides-net-zero-policies-in-new-order/\">[Read more]</a>",
                "full_text": "BOE Report February 5, 20257:11 PM Reuters0 Comments The secretarial order is meant to align the department with priorities outlined by President Donald Trump, who has called climate change a hoax and has vowed to maximize already record-high oil and gas output. “Net-zero policies raise energy costs for American families and businesses, threaten the reliability of our energy system, and undermine our energy and national security,” according to the order. “Going forward, the Department’s goal will be to unleash the great abundance of American energy required to power modern life and to achieve a durable state of American energy dominance,” it said. The order said the department would pursue plans Trump has already outlined to speed up energy permitting, strengthen grid resilience, expand nuclear power capacity, and refill the nation’s strategic crude oil stockpiles. The order offered no new details on how these goals would be achieved. Former President Joe Biden had set a target for the..."
            },
            {
                "title": "Oil pares losses after Saudi price increase",
                "link": "https://boereport.com/2025/02/05/oil-pares-losses-after-saudi-price-increase/",
                "summary": "Oil prices ticked up in early Asian trading on Thursday, steadying from a sell-off the previous day after Saudi Arabia&#8217;s state oil company sharply raised March oil prices. Brent crude futures rose 14 cents, or 0.19%, to $74.75 a barrel by 0148 GMT. U.S. West Texas Intermediate crude was up 18 cents, or 0.25%, to <a class=\"read-more\" href=\"https://boereport.com/2025/02/05/oil-pares-losses-after-saudi-price-increase/\">[Read more]</a>",
                "full_text": "BOE Report February 5, 20257:11 PM Reuters0 Comments Brent crude futures rose 14 cents, or 0.19%, to $74.75 a barrel by 0148 GMT. U.S. West Texas Intermediate crude was up 18 cents, or 0.25%, to $71.21 a barrel. Saudi Aramco, the world’s leading oil exporter, on Wednesday announced it would sharply increase prices to buyers in Asia for March delivery amid rising demand from China and India as U.S. sanctions disrupt Russian supply. Aramco also increased the March price for shipments across all other regions, suggesting that “the new sanctions against Russia are starting to bite and the Saudis have been able to take advantage of a tighter market,” said Tony Sycamore, market analyst with IG. The U.S. last month imposed aggressive new sanctions on Russia’s oil trade, targeting the “shadow vessels” understood to be utilised to evade trade blockades. “Additionally after the overnight sell-off and the Saudi news, there is likely to be some buying from traders covering shorts ahead of a strong..."
            },
            {
                "title": "Suncor’s fourth-quarter profit beats on higher oil output, fuel sale volumes",
                "link": "https://boereport.com/2025/02/05/suncors-fourth-quarter-profit-beats-on-higher-oil-output-fuel-sale-volumes/",
                "summary": "Canada&#8217;s Suncor Energy beat analysts&#8217; estimates for fourth-quarter profit on Wednesday, as the integrated oil and gas firm benefited from higher oil production and strong refined product sales volumes. The country&#8217;s oil producers benefited after the Trans Mountain Pipeline expansion project began commercial operations last year, as it increased their transportation capacity and opened up <a class=\"read-more\" href=\"https://boereport.com/2025/02/05/suncors-fourth-quarter-profit-beats-on-higher-oil-output-fuel-sale-volumes/\">[Read more]</a>",
                "full_text": "BOE Report February 5, 20253:16 PM Reuters0 Comments The country’s oil producers benefited after the Trans Mountain Pipeline expansion project began commercial operations last year, as it increased their transportation capacity and opened up market access to refineries in Asia and the U.S. West Coast. The expanded pipeline has nearly tripled the flow of crude from Alberta’s oil sands to British Columbia on the Pacific Coast to 890,000 barrels per day. Calgary, Alberta-based Suncor’s upstream production rose to 875,000 bpd during the fourth quarter from 808,000 bpd a year ago. The company said its refinery throughput rose to 486,000 bpd during the quarter, while its refinery utilization more than doubled. Suncor also achieved record refined product sales, up 6% at 613,300 bpd. The Canadian crude industry is now bracing for the impact from U.S President Donald Trump’s planned imposition of tariffs on the country. A major part of Canada’s crude exports go to the U.S. Suncor reaffirmed its..."
            }
        ]
    },
    "Oilfield Technology": {
        "feed_title": "Oilfield Technology",
        "feed_url": "https://www.oilfieldtechnology.com/rss/oilfieldtechnology.xml",
        "entries": [
            {
                "title": "SLB OneSubsea signs agreement with Vår Energi for upcoming subsea developments in Norway",
                "link": "https://www.oilfieldtechnology.com/offshore-and-subsea/05022025/slb-onesubsea-signs-agreement-with-vr-energi-for-upcoming-subsea-developments-in-norway/",
                "summary": "The award leverages the existing strategic subsea partnership agreement between the two companies for standardised subsea equipment, supporting multiple upcoming oil and gas developments on the Norwegian Continental Shelf (NCS).",
                "full_text": "For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Sectors Save to read list Published by Alfred Hamer, Editorial Assistant Oilfield Technology, Wednesday, 05 February 2025 09:00 SLB has announced an agreement between its OneSubsea™ joint venture and Vår Energi to deliver a sizeable subsea production systems (SPS) work scope. This award leverages the existing strategic subsea partnership agreement between the two companies for standardised subsea equipment, supporting multiple upcoming oil and gas developments on the Norwegian Continental Shelf (NCS). Under this SPS pre-commitment program, work commences immediately to deliver two equipment packages. The first package consists of a complete SPS system, including four vertical subsea trees, wellheads, templates, manifolds, umbilicals and all other associated SPS equipment, which upon delivery can be expediently deployed by Vår Energi to any fi..."
            },
            {
                "title": "Baker Hughes announces trio of electrification technologies for onshore, offshore operations",
                "link": "https://www.oilfieldtechnology.com/product-news/04022025/baker-hughes-announces-trio-of-electrification-technologies-for-onshore-offshore-operations/",
                "summary": "Baker Hughes, an energy technology company has announced three new electrification technologies that will provide enhanced reliability, increased efficiency and reduced emissions for onshore and offshore operations.",
                "full_text": "For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Sectors Save to read list Published by Alfred Hamer, Editorial Assistant Oilfield Technology, Tuesday, 04 February 2025 09:00 Baker Hughes, an energy technology company has announced three new electrification technologies that will provide enhanced reliability, increased efficiency and reduced emissions for onshore and offshore operations. These technologies, which have implications for both traditional oil and gas and new energy applications, were unveiled at Baker Hughes’ 25th Annual Meeting in Florence, Italy. The Hummingbird™ all-electric land cementing unit is an industry-first, 100% electric solution that replaces diesel engines with grid-connected or battery-powered motors. The Hummingbird’s dual-power functionality performs onshore cementing operations with lower emissions and noise levels compared to traditional solutions. The use of..."
            }
        ]
    },
    "AOG Digital": {
        "feed_title": "Asian Oil and Gas News",
        "feed_url": "https://aogdigital.com/news/latest?format=feed",
        "entries": [
            {
                "title": "McDermott Concludes Work at PTTEP’s Kikeh Gas Field Off Malaysia",
                "link": "https://aogdigital.com/news/521950-mcdermott-concludes-work-at-ptteps-kikeh-gas-field-off-malaysia",
                "summary": "McDermott has completed transportation, installation, and commissioning activities for the Kikeh subsea gas lift project, awarded by PTTEP Sabah Oil Limited (PTTEP) in the first quarter of 2024…",
                "full_text": "February 5, 2025 McDermott has completed transportation, installation, and commissioning activities for the Kikeh subsea gas lift project, awarded by PTTEP Sabah Oil Limited (PTTEP) in the first quarter of 2024. The project, executed by the company's Kuala Lumpur (KL) based team, in water depths of approximately 1,400 meters, progressed on a fast-track schedule. It involved the replacement of an existing gas lift riser, and the installation of a new dynamic riser section, flowline, and two thermoplastic composite pipe jumpers, essential to maintaining gas delivery to the subsea production system tied back the Kikeh floating production storage and offloading (FPSO) vessel. Rigorous safety protocols, readiness planning, robust engineering, and procurement efforts ensured seamless vessel mobilization, and completion of the offshore scope of work in under eight months. \"Completing the project ahead of schedule stands as testament to McDermott's capabilities in delivering safe and efficient..."
            },
            {
                "title": "Japan's Mitsui Eyes Alaska LNG Project",
                "link": "https://aogdigital.com/news/521866-japans-mitsui-eyes-alaska-lng-project",
                "summary": "Japanese trading house Mitsui could consider studying a project to liquefy natural gas (LNG) in the U.S. state of Alaska, but no decisions have been made yet, Chief…",
                "full_text": "February 4, 2025 Japanese trading house Mitsui could consider studying a project to liquefy natural gas (LNG) in the U.S. state of Alaska, but no decisions have been made yet, Chief Financial Officer Tetsuya Shigeta said on Tuesday. Japan is considering offering support for a $44-billion gas pipeline in Alaska as it seeks to court U.S. President Donald Trump and forestall potential trade friction, sources told Reuters last week. Shigeta said he hoped a meeting expected this week between Prime Minister Shigeru Ishiba and Trump would help enhance Japan's presence in the United States, reaffirming its role as the latter's largest source of investment. Asked about the reported LNG development in Alaska, Shigeta said it was a natural candidate for consideration, presenting a valuable opportunity because of its proximity to Japan and other Asian countries. \"But we have nothing we can talk about now, including our policy,\" he added. (Reuters - Reporting by Yuka Obayashi; Writing by Katya Golu..."
            },
            {
                "title": "Santos Hires Weststar-GAP for Timor-Leste Offshore Helicopter Services",
                "link": "https://aogdigital.com/news/521737-santos-hires-weststargap-for-timorleste-offshore-helicopter-services",
                "summary": "Australian oil and gas company Santos has signed a helicopter transportation services contract with Weststar-GAP Aviation for its offshore operations in Timor-Leste’s Bayu-Undan region…",
                "full_text": "January 31, 2025 Australian oil and gas company Santos has signed a helicopter transportation services contract with Weststar-GAP Aviation for its offshore operations in Timor-Leste’s Bayu-Undan region. Under the $40 million contract, Weststar-GAP Aviation, a joint venture between Timor GAP-Timor Gas Petroleo, E.P., and Weststar Aviation Timor, will start providing its services for Santos from February 1, 2025. Structured for an initial 12-month period with options for two six-month extensions, Weststar-GAP Aviation will provide helicopter transportation services supporting Santos’ offshore operations in the Bayu-Undan region. The agreement marks a critical milestone in WeststarGAP’s broader strategy to enhance offshore aviation services in Timor-Leste, with prospective growth into the Greater Sunrise field to support ENI and Sunda Gas. To fulfill this contract, Weststar-GAP will deploy two state-of-the-art Leonardo AW189 helicopters, renowned for their superior performance and reliabi..."
            },
            {
                "title": "Petronas Preps for Sabah-Sarawak Gas Pipeline Decom Op",
                "link": "https://aogdigital.com/news/521643-petronas-preps-for-sabahsarawak-gas-pipeline-decom-op",
                "summary": "Malaysia's Petronas will decommission the Sabah-Sarawak gas pipeline, the state energy firm said on Tuesday in its activity outlook report.The 500 km natural gas…",
                "full_text": "January 29, 2025 Malaysia's Petronas will decommission the Sabah-Sarawak gas pipeline, the state energy firm said on Tuesday in its activity outlook report. The 500 km natural gas pipeline in Malaysia connects Kimanis in Sabah to Bintulu in Sarawak and has been operational since early 2014. For the next three years, Petronas' decommissioning plans include the plugging and abandonment of about 153 wells and the abandonment of about 37 offshore facilities, according to the report. In November last year, the company lifted the force majeure on gas supply to the Dua Malaysia LNG terminal after it was shut in 2022 following a leak in the Sabah-Sarawak pipeline. (Reuters- Reporting by Nikita Maria Jino in Bengaluru; Editing by Shounak Dasgupta) AOG Digital E-News is the subsea industry's largest circulation and most authoritative ENews Service, delivered to your Email three times per week © 2025 AtCoMedia. Inc Release"
            },
            {
                "title": "European LNG Imports Up with Asian Influx",
                "link": "https://aogdigital.com/news/521626-european-lng-imports-up-with-asian-influx",
                "summary": "The world's imports of liquefied natural gas are set to jump to the highest in a year in January as Europe's winter demand draws cargoes away from top-consuming region Asia…",
                "full_text": "January 28, 2025 The world's imports of liquefied natural gas are set to jump to the highest in a year in January as Europe's winter demand draws cargoes away from top-consuming region Asia. A total of 38.12 million metric tons of the super-chilled fuel is on track to be imported in January, up from 37.69 million in December and the most since January 2024's 38.73 million, according to data compiled by commodity analysts Kpler. The January volume is also the third-highest on record, underscoring the strong growth in LNG imports as new supply comes online and as Europe seeks to replace pipeline natural gas from Russia. Europe's imports are expected by Kpler to rise to 11.82 million tons in January, up from 10.87 million in December and the highest since April 2023. The January volume for Europe is also on track to be the fourth-highest monthly total, eclipsed only by three months in 2022 and 2023 when the continent was scrabbling for gas after the shutdown of pipeline supplies from Russ..."
            }
        ]
    },
    "Adrian": {
        "feed_title": "Adrian - Oil and Gas",
        "feed_url": "http://adrianoil.blogspot.com/feeds/posts/default?alt=rss",
        "entries": [
            {
                "title": "Overconfidence in climate overshoot | Nature",
                "link": "http://adrianoil.blogspot.com/2024/11/overconfidence-in-climate-overshoot.html",
                "summary": "<div class=\"separator\" style=\"clear: both; text-align: left;\"><a href=\"https://www.mcc-berlin.net/fileadmin/_processed_/4/b/csm_211109_Erdatmosph%C3%A4re_1201525600_Shutterstock-leeborn_1000_2ddb19c3e3.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"419\" src=\"https://www.mcc-berlin.net/fileadmin/_processed_/4/b/csm_211109_Erdatmosph%C3%A4re_1201525600_Shutterstock-leeborn_1000_2ddb19c3e3.jpg\" width=\"629\" /></a></div>Earth’s atmosphere: if humanity emits more greenhouse gases than is compatible with the temperature limit, it will have to take countermeasures with net removals later. | Photo: Shutterstock/leeborn<br /><div><br /></div><div><div>Abstract</div><div>Global emission reduction efforts continue to be insufficient to meet the temperature goal of the Paris Agreement1. This makes the systematic exploration of so-called overshoot pathways that temporarily exceed a targeted global warming limit before drawing temperatures back down to safer levels a priority for science and policy2,3,4,5. Here we show that global and regional climate change and associated risks after an overshoot are different from a world that avoids it. We find that achieving declining global temperatures can limit long-term climate risks compared with a mere stabilization of global warming, including for sea-level rise and cryosphere changes. However, the possibility that global warming could be reversed many decades into the future might be of limited relevance for adaptation planning today. Temperature reversal could be undercut by strong Earth-system feedbacks resulting in high near-term and continuous long-term warming6,7. To hedge and protect against high-risk outcomes, we identify the geophysical need for a preventive carbon dioxide removal capacity of several hundred gigatonnes. Yet, technical, economic and sustainability considerations may limit the realization of carbon dioxide removal deployment at such scales8,9. Therefore, we cannot be confident that temperature decline after overshoot is achievable within the timescales expected today. Only rapid near-term emission reductions are effective in reducing climate risks.</div></div><div><br /></div>Full story (Open access):&nbsp;<a href=\"https://www.nature.com/articles/s41586-024-08020-9\">Overconfidence in climate overshoot | Nature</a><img id=\"image-hover-icon\" src=\"chrome-extension://pbhpcbdjngblklnibanbkgkogjmbjeoe/src/public/images/128px.png\" style=\"cursor: pointer; display: block; height: 25px; width: 25px;\" />",
                "full_text": "Following what goes on with oil and gas exploitation in and around Adrian, Michigan since 2013 - and how these events in our little city connect to the global environmental situation... - with the occasional sidetrack to other related environmental issues in Lenawee county, Michigan and how those relate to global issues. Post a Comment"
            },
            {
                "title": "EcoHealth Score Card for River Raisin: No Reason to Celebrate!",
                "link": "http://adrianoil.blogspot.com/2024/10/ecohealth-score-card-for-river-raisin.html",
                "summary": "<p>The River Raisin Watershed Council recently reported the results of the EcoCard Scoring by The University of Maryland Center for Environmental Science as a success story. From my personal experience as a Biology Professor teaching Freshwater Ecology for the last 15 years, I do not find a score of 54% acceptable, and neither is the label \"Moderate\" or a C grade justified with a low percentage like 54%. In fact, in most college grading schedules, anything below 60% is a failing grade of E or F. As in education, weakening a meaningful scale just because a peer group scores evenly low is not an accurate quality measure.</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjIEXKOONKmIdPoOMK7U0ggJfdWhDK29lhixxvW9CGbUVZhyphenhyphenE4ZGKxJalqEsgledAh0E0QQaVVYlUAW83T-pnlXZDucWkooF4THwRy6ISysCvMqOjsON49PLU7-zkcOCM-gB_e_XzwEqjZxtMhkKMUrdOj6QDf46lFYZPUdoqf1k4o5Lyzbi0DYLICL_jaO/s1059/image_2024-10-26_124100593.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"506\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjIEXKOONKmIdPoOMK7U0ggJfdWhDK29lhixxvW9CGbUVZhyphenhyphenE4ZGKxJalqEsgledAh0E0QQaVVYlUAW83T-pnlXZDucWkooF4THwRy6ISysCvMqOjsON49PLU7-zkcOCM-gB_e_XzwEqjZxtMhkKMUrdOj6QDf46lFYZPUdoqf1k4o5Lyzbi0DYLICL_jaO/w630-h506/image_2024-10-26_124100593.png\" width=\"630\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Figure 1: Details of the 2024 scoring for the River Raisin. Source:&nbsp;The University of Maryland Center for Environmental Science, <a href=\"https://ecoreportcard.org/report-cards/river-raisin/\" target=\"_blank\">https://ecoreportcard.org/report-cards/river-raisin/</a>&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">The dire situation of the River Raisin and many assessed watersheds and waterbodies becomes even more alarming when we disentangle the arbitrarily lumped categories of the scoring and exclude metrics that do not directly correspond to the environmental health of the water body, such as local ownership, affordable housing, beach access, walkability, household income, river economy, and even air quality. As much as these categories are essential in the quality of living, diversity, equity and inclusion, and environmental justice, they distract from even lower scores of metrics directly reflecting water quality, such as 17% for bacteria, 12% for nitrogen, and protected lands, and low scores around 20% for turbidity leading to widespread smothering and embeddedment, low tree and forest cover and high heat vulnerability and risks when consuming fish from the river.&nbsp;&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">Sure, we need some good news in all the doomsday scenarios of climate change, societal disconnect, manipulation of information, genocide, and rising totalitarianism. However, celebrating severe impairment and shortcomings as success keeps us from realizing that we are in a severe environmental crisis and need to address the root causes of the issues, which require systemic changes rather than small voluntary efforts of individuals. We need to curb the influx of fertilizer from corn and soy monocultures and runoff from industrial cattle and hog farms by converting industrial farming to regenerative and agroecological practices rather than trying to reduce the issues with voluntary buffer strips and precision agriculture. We must transform our energy-intensive economy and lifestyles depending on fossil fuels to energy-conserving, humble lifestyles, and efficient economies based on clean, renewable energy instead of trying to reduce our footprints using personally owned electric vehicles and solar panels while maintaining or increasing our high-energy demanding lifestyles.</div><br />&nbsp;<p></p><img id=\"image-hover-icon\" src=\"chrome-extension://pbhpcbdjngblklnibanbkgkogjmbjeoe/src/public/images/128px.png\" style=\"cursor: pointer; display: none; height: 25px; width: 25px;\" />",
                "full_text": "Following what goes on with oil and gas exploitation in and around Adrian, Michigan since 2013 - and how these events in our little city connect to the global environmental situation... - with the occasional sidetrack to other related environmental issues in Lenawee county, Michigan and how those relate to global issues. The River Raisin Watershed Council recently reported the results of the EcoCard Scoring by The University of Maryland Center for Environmental Science as a success story. From my personal experience as a Biology Professor teaching Freshwater Ecology for the last 15 years, I do not find a score of 54% acceptable, and neither is the label \"Moderate\" or a C grade justified with a low percentage like 54%. In fact, in most college grading schedules, anything below 60% is a failing grade of E or F. As in education, weakening a meaningful scale just because a peer group scores evenly low is not an accurate quality measure. Post a Comment"
            }
        ]
    },
    "Yokogawa": {
        "feed_title": "Energy and Renewables",
        "feed_url": "https://www.yokogawa.com/eu/blog/oil-gas/en/feed/",
        "entries": [
            {
                "title": "Top 10 most important actions to ensure successful digital transformation",
                "link": "https://www.yokogawa.com/eu/blog/renewables/en/top-10-most-important-actions-to-ensure-successful-digital-transformation/",
                "summary": "<p>Digital Transformation is, nowadays, a buzzing world in industry, which everybody wants to utilize and apply in their business. Nevertheless, it is also starting to be a major cause of confusion, empty promises and big words with no real impact&#8230; </p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.yokogawa.com/eu/blog/renewables/en/top-10-most-important-actions-to-ensure-successful-digital-transformation/\"> <span class=\"screen-reader-text\">Top 10 most important actions to ensure successful digital transformation</span> Read More &#187;</a></p>\n<p>The post <a href=\"https://www.yokogawa.com/eu/blog/renewables/en/top-10-most-important-actions-to-ensure-successful-digital-transformation/\" rel=\"nofollow\">Top 10 most important actions to ensure successful digital transformation</a> appeared first on <a href=\"https://www.yokogawa.com/eu/blog/renewables/en/\" rel=\"nofollow\">Energy and Renewables</a>.</p>",
                "full_text": "Digital Transformation is, nowadays, a buzzing world in industry, which everybody wants to utilize and apply in their business. Nevertheless, it is also starting to be a major cause of confusion, empty promises and big words with no real impact […] Digital Transformation is, nowadays, a buzzing world in industry, which everybody wants to utilize and apply in their business. Nevertheless, it is also starting to be a major cause of confusion, empty promises and big words with no real impact on business performance. Why is there such an extreme dichotomy in the most important enabler for our Future Digital Energy Systems? According to McKinsey, Deloitte and many more consulting companies, over 70% of digital transformation initiatives have failed. These are not optimistic numbers concerning such a crucial part of the journey ahead. So, what should exemplary digital transformation look like? There is no silver bullet to answer this question, but three main universal guidelines are: Out of ..."
            },
            {
                "title": "Emissions — genuine evidence of arrogance or a smart measure of sustainability?",
                "link": "https://www.yokogawa.com/eu/blog/renewables/en/emissions-genuine-evidence-of-arrogance-or-a-smart-measure-of-sustainability/",
                "summary": "<p>Having in mind different Energy Transition scenarios mentioned in my last article,&#160;society, business, and legislation have a hurdle how to properly assess its contribution to our end goal, which is saving the planet. A common denominator for Energy Efficiency, Decarbonization,&#8230; </p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.yokogawa.com/eu/blog/renewables/en/emissions-genuine-evidence-of-arrogance-or-a-smart-measure-of-sustainability/\"> <span class=\"screen-reader-text\">Emissions — genuine evidence of arrogance or a smart measure of sustainability?</span> Read More &#187;</a></p>\n<p>The post <a href=\"https://www.yokogawa.com/eu/blog/renewables/en/emissions-genuine-evidence-of-arrogance-or-a-smart-measure-of-sustainability/\" rel=\"nofollow\">Emissions — genuine evidence of arrogance or a smart measure of sustainability?</a> appeared first on <a href=\"https://www.yokogawa.com/eu/blog/renewables/en/\" rel=\"nofollow\">Energy and Renewables</a>.</p>",
                "full_text": "Having in mind different Energy Transition scenarios mentioned in my last article, society, business, and legislation have a hurdle how to properly assess its contribution to our end goal, which is saving the planet. A common denominator for Energy Efficiency, Decarbonization, […] Having in mind different Energy Transition scenarios mentioned in my last article, society, business, and legislation have a hurdle how to properly assess its contribution to our end goal, which is saving the planet. A common denominator for Energy Efficiency, Decarbonization, and Decentralization is their impact on emissions. So, let’s have a better look at what are emissions and if they can be the main qualifier and quantifier of the success of Energy Transition. Let’s start with some academics — What do we understand under emissions or to be more specific greenhouse gas (GHG) emissions? Greenhouse gases are gaseous constituents of the atmosphere, both natural and anthropogenic, that absorb and emit radiati..."
            }
        ]
    },
    "Medium": {
        "feed_title": "DeepStream - Medium",
        "feed_url": "https://medium.com/feed/deepstream-tech",
        "entries": [
            {
                "title": "Gardenia Technologies joins DeepStream’s RFx platform to accelerate credit decisions in the supply…",
                "link": "https://medium.com/deepstream-tech/gardenia-technologies-joins-deepstreams-rfx-platform-to-accelerate-credit-decisions-in-the-supply-29a28671dbbe?source=rss----7b5cf67041de---4",
                "summary": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*MFl0CvI3B9mvsNlq4H9_LA.png\" /><figcaption>Gardenia Technologies and DeepStream — new partnership</figcaption></figure><h3>Gardenia Technologies joins DeepStream’s RFx platform to accelerate credit decisions in the supply chain</h3><h4>We’re very excited to announce the latest partnership with London-based FinTech company Gardenia Technologies</h4><p>With DeepStream’s RFx platform, Gardenia Technologies will improve audibility and transparency of complex trade-related data to accelerate credit decisions in the supply chain. DeepStream’s cloud-based technology reduces operational costs and spend within an incredibly powerful but user-friendly solution, totally digitising all RFx (request for anything) communications within an auditable and secure application.</p><p>‍This is a technology that goes hand-in-hand with Gardenia Technologies that are focused on improving companies’​ bottom-line and profitability through the use of proprietary advanced analytics and systematic working capital finance solutions.</p><p><em>‍More on the partnership coming soon — stay tuned!</em></p><p>‍<em>Want to know more about how you can boost your RFx processes — reducing source-to-award time by 500%? Click </em><a href=\"https://calendly.com/hammarskiold/intro\"><em>here</em></a><em> to book your demo today!</em></p><p><strong>About DeepStream</strong></p><p>Emailing suppliers and counterparties is simple. But when many internal and external people collaborate in RFx processes, exchanging large amounts of information (prices, pre-qualification, clarifications, deviations, contracts, etc.) with multiple businesses, things start to get messy. Doing this manually on emails leads to compliance risks, inefficiencies, frustration and bloated spend. With the latest agile technology, DeepStream has built the fastest and most-user friendly RFx platform ever made, migrating all communication onto a collaborative, auditable and network based secure cloud application. Read more at <a href=\"http://deep.stream/\">deep.stream</a></p><p><strong>About Gardenia Technologies</strong></p><p>Gardenia Technologies is a FinTech company, improving companies’​ bottom-line and profitability through the use of proprietary advanced analytics and systematic working capital finance solutions.Data-driven, advanced real-time analytics providing root cause analysis of process inefficiencies; insights-to-value visualisations of improvement and optimisation opportunities; and forecasting tools to help accelerate growth.Data-driven invoice financing solutions, using machine learning algorithms on complex trade-related data to accelerate credit decisions​; supported by a private, Aaa-rated funding structure; and a streamlined risk management and reporting system. Find out more at <a href=\"https://www.gardeniatech.com/\">gardeniatech.com</a></p><p>‍</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=29a28671dbbe\" width=\"1\" /><hr /><p><a href=\"https://medium.com/deepstream-tech/gardenia-technologies-joins-deepstreams-rfx-platform-to-accelerate-credit-decisions-in-the-supply-29a28671dbbe\">Gardenia Technologies joins DeepStream’s RFx platform to accelerate credit decisions in the supply…</a> was originally published in <a href=\"https://medium.com/deepstream-tech\">DeepStream</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>",
                "full_text": "Sign up Sign in Sign up Sign in Jack Macfarlane Follow DeepStream -- Listen Share With DeepStream’s RFx platform, Gardenia Technologies will improve audibility and transparency of complex trade-related data to accelerate credit decisions in the supply chain. DeepStream’s cloud-based technology reduces operational costs and spend within an incredibly powerful but user-friendly solution, totally digitising all RFx (request for anything) communications within an auditable and secure application. ‍This is a technology that goes hand-in-hand with Gardenia Technologies that are focused on improving companies’​ bottom-line and profitability through the use of proprietary advanced analytics and systematic working capital finance solutions. ‍More on the partnership coming soon — stay tuned! ‍Want to know more about how you can boost your RFx processes — reducing source-to-award time by 500%? Click here to book your demo today! About DeepStream Emailing suppliers and counterparties is simple. Bu..."
            },
            {
                "title": "Next-gen shipbrokers are adapting to shifting sands and expanding market share with agile tech",
                "link": "https://medium.com/deepstream-tech/next-gen-shipbrokers-are-adapting-to-shifting-sands-and-expanding-market-share-with-agile-tech-b71cf8efd786?source=rss----7b5cf67041de---4",
                "summary": "<h3>Next-gen shipbrokers are adapting to shifting sands and expanding market share with agile technology</h3><h4>The times are changing. Fast.</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*T_sFAexDy8Vqtr_tYBEPvA.jpeg\" /></figure><p>We have seen an explosion in digital adoption from businesses across the supply chain over the past year, with COVID induced remote working putting a knife into the stranglehold that manual processes had in some corners of the industrial business world.</p><p>This adoption has been furthered by the increasing attention which global companies are paying to supply chain transparency and sustainability: something which digitalisation enables by creating more auditable processes and information sharing across counterparties. No more hiding behind thousands of opaque email trails.</p><p>Shipbroking, a naturally communication intensive process, is a logical supply chain function that can take advantage of digital tools to increase its service offering to clients. End clients who value sustainable and efficient practices expect as a minimum that their brokers carry out all communication with potential suppliers in a transparent and auditable way, and move away from emails in these efforts.</p><h4>DeepStream created a “Multi Sided Buyer” digital module specifically for brokers to digitise their RFx offering.</h4><p>The traditional assumption that there was 1 business on the “buyer side” and multiple businesses on the “supplier side” was not fit for purpose — and as such was leading to businesses reverting back to emails &amp; attachments for supply chain communication, with all the risks that entails.</p><p>This applies equally to buyer-broker dynamics as it does to joint-venture dynamics and regulator-buyer dynamics. With flexibility, user-friendliness and security at the core of our product, we created a next-gen solution for next-gen businesses looking to digitise these supply chain communication flows.</p><p>Our product guru built out the ability to add on as many “Collaborators” to the buyer side of an RFx (tender) process as our users wanted — as always purely based on user feedback and zero pre-baked assumptions.</p><h4>The proof is in the pudding.</h4><p>The product has been battle hardened handling a huge amount of flows with brokers driving RFx transactions on behalf of clients — we have had north of 90 active shipping businesses transacting on DeepStream over the past couple of months.</p><p>Recently, we had a very cool RFx use case going through the platform. A partner of ours, a major global broker, completed an RFx acting on behalf of over 5 clients. As usual, all communication out to target suppliers was done within the platform, replacing emails &amp; attachments in their entirety.</p><p>Via the proprietary ‘Multi-Sided Buyer’ architecture which the DeepStream cloud platform has, the partner was able to give granular audit only rights and bid unlocking rights to its end buyer clients. Previously, end clients in brokered RFx transactions had limited at best (zero at worst) visibility and auditability of all of the communication flows within the RFx process that was being done on their behalf. Using DeepStream, the partner was able to demonstrate their best-in-class value delivery in managing the entire RFx process, ensuring that their clients had real time audibility and rights based on granular permissions systems within the platform.</p><p>With over 30 target suppliers the streamlining of this information was not only an enhancement of auditability and communication compliance standards, but saved a huge amount of admin time for all parties (just think of all the emails which would have been flying around between employees at 40+ businesses all trying to get an RFx transaction done).</p><h4>Opening sealed bids… without being allowed into the same room.</h4><p>I always found it fascinating that the physical in-person opening bid ceremony was such a common practice.</p><p>So for some of our target businesses a spanner was thrown into the works when in person COVID restrictions were put into place. They wanted to trade! But there was the thorny issue of not being able to open bids in person at the same time whilst singing Kumbaya My Lord*. This had become impossible, but business needed to go on.</p><p>DeepStream came to the rescue — our platform allows users to replicate in-person sealed bid unlocking totally digitally. Sealed bids are put in place, unlocking mechanisms set within the platform, allowing the same practice to be done — but with every user able to do it via their secure access to their DeepStream account. In fact, with immutable audibility done in real time, the digital unlocking process is vastly more secure and compliant than doing unsealing bids in person.</p><p>This has been particularly useful for some of our shipbroker partners — again allowing them to solve business critical issues for their clients with the latest agile technology available.</p><p>DeepStream comes in as a game changer for the ship-broking industry, allowing them to deliver a better service to their clients whilst doing it within a completely secure digital environment — especially relevant in the current remote working environment.</p><h4>Next-gen shipbrokers are winning market share</h4><p>Brokers, as “middle men” within the supply chain, have often viewed digital software with some suspicion which has hindered adoption. This has hurt their service offering: denying their clients the compliance and efficiency that digital automation can deliver.</p><p>Some have decided to follow the failed approach of trying to build everything “in house” — a bit like BMW serving up a terrible BMW-owned map navigation experience, rather than using Google or Apple Maps. Specialisation of labour is real.</p><p>However, others have had the vision to adopt rather than resist agile technology to enhance their service offering for clients. In supporting these next-gen shipbrokers and the efforts in creating a more efficient and sustainable ecosystem, DeepStream have ensured that its digital platform caters for specific broker dynamics. The ‘Muti-Sided Buyer’ model outlined above is just one such example.</p><p>The end result is an enhanced offering for shipping clients that use our partner’s broking services, with our partner also being able to guide future software developments put in place by DeepStream. We are 100% agile and push out new enhancements every 2 weeks (in 2020 so far we have released 52 new enhancements to the product).</p><h4>So yes, the pudding tastes delicious.</h4><p>And I would also go further: end clients sticking with manual processes rather than going digital are endorsing non compliant and non sustainable supply chain practices.</p><p>Head over to <a href=\"https://www.deep.stream/\">deep.stream</a> to request access and see what fresh new enterprise technology tastes like.</p><p>*I do not think that this is actually common practice.</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=b71cf8efd786\" width=\"1\" /><hr /><p><a href=\"https://medium.com/deepstream-tech/next-gen-shipbrokers-are-adapting-to-shifting-sands-and-expanding-market-share-with-agile-tech-b71cf8efd786\">Next-gen shipbrokers are adapting to shifting sands and expanding market share with agile tech</a> was originally published in <a href=\"https://medium.com/deepstream-tech\">DeepStream</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>",
                "full_text": "Sign up Sign in Sign up Sign in Jack Macfarlane Follow DeepStream -- Listen Share We have seen an explosion in digital adoption from businesses across the supply chain over the past year, with COVID induced remote working putting a knife into the stranglehold that manual processes had in some corners of the industrial business world. This adoption has been furthered by the increasing attention which global companies are paying to supply chain transparency and sustainability: something which digitalisation enables by creating more auditable processes and information sharing across counterparties. No more hiding behind thousands of opaque email trails. Shipbroking, a naturally communication intensive process, is a logical supply chain function that can take advantage of digital tools to increase its service offering to clients. End clients who value sustainable and efficient practices expect as a minimum that their brokers carry out all communication with potential suppliers in a transpa..."
            },
            {
                "title": "TAQA Morocco digitises its supply chain with DeepStream’s agile technology",
                "link": "https://medium.com/deepstream-tech/taqa-morocco-digitises-its-supply-chain-with-deepstreams-agile-technology-d09187fc135b?source=rss----7b5cf67041de---4",
                "summary": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*3-NyCN-tmT1s8V4dosB_cw.jpeg\" /></figure><p>TAQA Morocco, a subsidiary of the newly integrated TAQA Global and AD Power, has adopted DeepStream’s SaaS technology to digitise their coal procurement operations, moving towards a more efficient and sustainable supply chain future.</p><p><strong>Highlights:</strong></p><p>● DeepStream Technologies (“DeepStream”) is a collaborative platform for critical business-to-business (“B2B”) data exchanges including industrial tendering, logistics and project execution.</p><p>● The cloud-based technology reduces operational costs and spend within an incredibly powerful but user-friendly solution, totally digitising all RF<em>x</em> (request for <em>anything</em>) communications within an auditable and secure application.</p><p>● TAQA Morocco will use DeepStream to assure digital transparency during its tenders and materially reduce risk thanks to greater transparency across the supply chain, helping fulfil their sustainable supply chain vision.</p><h3>The customer journey</h3><p>TAQA Morocco is the first private producer of electricity in Morocco and a major player in the energy sector in Morocco covering more than 43% of the electricity national production and 19% of the installed capacity.</p><h3>The challenge</h3><p>Prior to the adoption of DeepStream, TAQA Morocco was using manual processes for all of coal supplier communications, being either emails &amp; attachments or — in some cases — physical delivery of RFx bid documents from suppliers.</p><p>With these processes came a number of operational risks (namely compliance and auditability of communication flows) as well as just being a big trade friction cost in dealing with suppliers with such outdated forms of communication.</p><p>However, given the strategic and critical nature of RFx communications, their RFx processes required a flexible platform that did not dictate how TAQA Morocco could communicate with their suppliers. They required an agile, flexible, user-friendly and intuitive digital platform to run all of their supplier communication.</p><h3>The solution</h3><p>After entering into a light subscription agreement, TAQA Morocco was able to send out their first RFx transactions within 6 days in a totally remote environment — this lightning fast time-to-value “implementation”, led by the London based Customer Success team at DeepStream, is a testament to the user friendliness of the platform.</p><p>Within 4 weeks, TAQA Morocco were increasing their usage, with a number of power users, and had organically onboarded (themselves — this is done in-application) a material number of their suppliers, moving all of the communication (be it structured RFx communication or just more simple chat/ messaging) onto the digital platform. This meant that all communications flows became auditable in real time and the time required (and manual admin required) to liaise with suppliers in the source to award process was cut down by over 200%.</p><p>The extra</p><p>As a 100% agile company, DeepStream was able to incorporate TAQA Morocco feedback into its product roadmap from day 1. In practice, this meant that within the 8 “releases” (being new software enhancements made to the DeepStream application) occurring within the first 2 months of TAQA Morocco being a DeepStream client (the application is improved with releases on average every 2 weeks), their needs were taken into account with regards to new agile functionality being added to the software.</p><p>For example, new Automated Template functionality was released in this period, and enhanced DeepStream Auction functionality is soon to be released having taken into account TAQA Morocco feedback.</p><p>Furthermore, in a COVID-19 world where digital collaboration between users in facilitating business transactions has become even more important, TAQA Morocco were able to use the DeepStream communication tools to ensure there was no drop off in ability to effectively engage and award work to its suppliers throughout the pandemic.</p><h3>Mohamed Berrechid, TAQA Morocco Fuel Procurement Director, commented:</h3><p>“In 2020, we realised that digitisation of the supply chain has no longer become “optional.” This pandemic has taught us that it’s important to embrace change and keep up with new technology. We looked at many products but most of them used prescriptive software and lacked user-friendliness. The team at DeepStream has been updating their software in response to our needs and improvements in technology (in addition to pre-qualification and reverse auction) consistently showing us that they are customer-centric. We couldn’t have asked for a better digital solution.”</p><h3>Jack Macfarlane, DeepStream Technologies Chief Executive Officer, commented:</h3><p>“We are thrilled to be a part of TAQA Morocco’s digital transformation journey, and having them as a client has capped a tremendous 6 months of growth for industrial companies adopting our user friendly digital technology. Poor communication fluidity and outdated software with a terrible user-experience are the enemies of efficient and sustainably compliant industrial supply chains. We have found TAQA Morocco to be incredibly forward looking and pro-digitalisation, which within the current remote working environment is more important than ever to ensure business continues to grow in adverse macro conditions.”</p><p><strong>About TAQA</strong></p><p>Established in 2005, TAQA is a diversified utilities and energy group headquartered in Abu Dhabi, the capital of the United Arab Emirates, and listed on the Abu Dhabi Securities Exchange (ADX: TAQA). TAQA has significant investments in power and water generation, transmission and distribution assets, as well as upstream and midstream oil and gas operations. The company’s assets are in the United Arab Emirates as well as Canada, Ghana, India, Iraq, Morocco, Oman, the Netherlands, Saudi Arabia, the United Kingdom and the United States. For more information, please visit: <a href=\"http://www.taqa.com\">www.taqa.com</a>.</p><p><strong>About TAQA Morocco (BVC: TQM)</strong></p><p>A leading energy player in Africa and the Middle East, TAQA Morocco operates the Jorf Lasfar thermal power plant. The industrial infrastructure of six units total installed capacity of 2,056 megawatts is ranked in the top decile of the most efficient power plants in the world. The company, listed on the Casablanca Stock Exchange (CSE: TQM), is part of the TAQA PJSC Group which allows TAQA to position itself as partner of choice for the energy development in the Kingdom of Morocco and Africa.</p><p>TAQA Morocco is also committed to CSR, pursuing an active policy for social commitment and sustainable development, including the responsible management of its assets to maintain the highest of environmental and safety standards.</p><p><strong>About DeepStream Technologies Ltd (</strong><a href=\"https://deep.stream\"><strong>deep.stream</strong></a><strong>)</strong></p><p>DeepStream Technologies is a London, UK based software technology company whose mission is to securely and transparently digitise the data exchange processes between businesses in facilitating commercial transactions, where integrity is paramount and collaboration of high value. By developing a highly user-friendly product with the latest software technology available to an underserved enterprise market, DeepStream has now facilitated over US$1bn of industrial tender based transactions globally.</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d09187fc135b\" width=\"1\" /><hr /><p><a href=\"https://medium.com/deepstream-tech/taqa-morocco-digitises-its-supply-chain-with-deepstreams-agile-technology-d09187fc135b\">TAQA Morocco digitises its supply chain with DeepStream’s agile technology</a> was originally published in <a href=\"https://medium.com/deepstream-tech\">DeepStream</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>",
                "full_text": "Sign up Sign in Sign up Sign in Philip Madero Hammarskiöld Follow DeepStream -- Listen Share TAQA Morocco, a subsidiary of the newly integrated TAQA Global and AD Power, has adopted DeepStream’s SaaS technology to digitise their coal procurement operations, moving towards a more efficient and sustainable supply chain future. Highlights: ● DeepStream Technologies (“DeepStream”) is a collaborative platform for critical business-to-business (“B2B”) data exchanges including industrial tendering, logistics and project execution. ● The cloud-based technology reduces operational costs and spend within an incredibly powerful but user-friendly solution, totally digitising all RFx (request for anything) communications within an auditable and secure application. ● TAQA Morocco will use DeepStream to assure digital transparency during its tenders and materially reduce risk thanks to greater transparency across the supply chain, helping fulfil their sustainable supply chain vision. TAQA Morocco is ..."
            },
            {
                "title": "How Premier Oil North Sea Digitised Their Tendering Process",
                "link": "https://medium.com/deepstream-tech/how-premier-oil-north-sea-digitised-their-tendering-process-9f8eb9d37d01?source=rss----7b5cf67041de---4",
                "summary": "<h3>How Premier Oil North Sea digitised their tendering process</h3><h4>Premier Oil North Sea Implements DeepStream Technologies To Help Mitigate Risk And Reduce Time And Cost In The Engagement With The Supply Chain</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*r1zJAqTtQEP8q99_ZrZRaA.jpeg\" /></figure><p>Premier Oil (LON:PMO) has signed a contract with DeepStream for their SaaS technology to digitise the tendering process within procurement operations. Premier Oil procures a significant amount of equipment and services annually including many complex packages which involve extensive involvement of procurement, technical and legal teams across the organisation. This is an intensive process including the exchange of large volumes of sensitive and detailed information with contractors and intermediaries within their supply chain.</p><p>DeepStream ensures that the tendering process is more transparent and efficient as well as fully auditable: reducing compliance risks and cost. The platform makes knowledge sharing among teams and reporting more effective whilst facilitating collaboration with Joint Venture Partners and other external business associates within the secure communication application.</p><p>Steven Petrie, Premier Oil UKBU Supply Chain Manager, commented:</p><p>“It’s important that we have best-in-class processes and technology to ensure our operations continue to be robust and efficient. In our supply chain operations we are focused on performance in terms of delivering value and assuring communication auditability and compliance: DeepStream is making a significant contribution to those objectives”</p><p>Jack Macfarlane, DeepStream Technologies Chief Executive Officer, commented:</p><p>“DeepStream is delighted to be working with Premier Oil in the UKCS, and we have been extremely impressed with their ambitions in leading the way towards a digital and transparent supply chain, sharing our vision in using technology to drive overall industry collaboration. We are not only facilitating a dramatically improved software experience for Premier Oil, but also enabling a secure and auditable tendering platform which removes the compliance risks associated with opaque email &amp; attachment driven processes”.</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=9f8eb9d37d01\" width=\"1\" /><hr /><p><a href=\"https://medium.com/deepstream-tech/how-premier-oil-north-sea-digitised-their-tendering-process-9f8eb9d37d01\">How Premier Oil North Sea Digitised Their Tendering Process</a> was originally published in <a href=\"https://medium.com/deepstream-tech\">DeepStream</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>",
                "full_text": "Sign up Sign in Sign up Sign in Philip Madero Hammarskiöld Follow DeepStream -- Listen Share Premier Oil (LON:PMO) has signed a contract with DeepStream for their SaaS technology to digitise the tendering process within procurement operations. Premier Oil procures a significant amount of equipment and services annually including many complex packages which involve extensive involvement of procurement, technical and legal teams across the organisation. This is an intensive process including the exchange of large volumes of sensitive and detailed information with contractors and intermediaries within their supply chain. DeepStream ensures that the tendering process is more transparent and efficient as well as fully auditable: reducing compliance risks and cost. The platform makes knowledge sharing among teams and reporting more effective whilst facilitating collaboration with Joint Venture Partners and other external business associates within the secure communication application. Steven..."
            }
        ]
    }
}
