[
{"title": "Behind the Book presents Kevin Hand in conversation with Victoria Orphan", "content": "Just months after  Europa Clipper was launched  from the Kennedy Space Center,  Behind The Book  presents JPL researcher and author Kevin Hand in conversation with Caltech professor Victoria Orphan. Hand's book,  Alien Oceans: The Search for Life in the Depths of Space , argues that the notion of the habitable zone should be expanded. At least six moons in the outer solar system are likely to have oceans of water beneath icy facades. Could they support life? Kevin Hand  is an astrobiologist and planetary scientist at JPL. He is also the founder of Cosmos Education and was its president until 2007. He was working at NASA Ames when he was inspired to form Cosmos Education in 1999 after getting a grant from the Earth and Space Foundation to tour African schools to talk about how education relates to space research. Victoria J. Orphan  is the James Irvine Professor of Environmental Science and Geobiology, and Allen V.C. Davis and Lenabelle Davis Leadership Chair and Director of the Center for Environmental Microbial Interactions. Admission is free but  reservations are required . Reserve your ticket(s)", "url": "https://www.caltech.edu/campus-life-events/calendar/behind-the-book-alien-oceans-kevin-hand-victoria-orphan", "date": "Tuesday, February 11, 2025", "location": "Ramo Auditorium"},
{"title": "Astronomy on Tap", "content": "POSTPONED TO FEBRUARY 3 DUE TO ILLNESS AND WEATHER. Fast radio bursts are explosions that can outshine an entire galaxy for a brief moment--but what causes them? What does it take to build and launch a major NASA mission towards the Jupiter system to search for the evidence of life? Join us Monday, January 27th at 7:30PM as we discuss these topics and more at our next Astronomy on Tap. We'll host two ~20 minute talks, Q&A, and then follow it up with interactive, astronomical pub trivia, live rock music, and guided stargazing with telescopes!   7:30 p.m. - Fast Radio Bursts: Outshining a Galaxy in the Blink of an Eye 8:15 p.m. - Building Europa Clipper 9:00 p.m. - Astro-themed Pub Trivia Answers and Prizes About the Series Astronomy on Tap  is a global phenomenon where professional astronomers give informal science talks in local bars with accompanying pub trivia and interactions with the public. Scientists at Caltech organize the  Los Angeles Chapter of Astronomy on Tap  one Monday a month. We host these free events which are open to all at the outdoor patio of the  Dog Haus Biergarten  in Old Town Pasadena (with  inexpensive parking structure  one block away). Each event consists of two ~20-minute informal science talks given by researchers in astronomy, physics, and space science followed by Q&A. In the intermission periods, we have guided stargazing with telescopes, astro-themed pub trivia, and live music from  Jason Achilles and Forrest Mitchell . Event is free and open to all. No reservations necessary. For more information and recordings of past events, please see the  Caltech Astro Outreach website  and the  Caltech Astro YouTube page .", "url": "https://www.caltech.edu/campus-life-events/calendar/astronomy-on-tap-48", "date": "Monday, February 3, 2025", "location": null},
{"title": "Environmental Impacts of Fires at the Wildland-Urban Interface", "content": "How do scientists measure air quality, and what do we know about the air in greater Los Angeles following the January fires? Join experts from Caltech, the Jet Propulsion Laboratory (JPL), and the University of Colorado Boulder to learn more about the environmental hazards of smoke and lessons learned from previous similar fires. ►REGISTER TODAY Viewers can submit their own questions for the panelists via the registration form or during the live session. More information, including speaker bios.", "url": "https://www.caltech.edu/campus-life-events/calendar/environmental-impacts-of-fires-at-the-wildland-urban-interface-1", "date": "Friday, January 31, 2025", "location": null}
]